<div class="mume markdown-preview  ">

    <h1 class="mume-header" id="important-enhancementsnotes">3.3.0 Wichtige Verbesserungen/Notizen (11.4.2022)</h1>

    <h2 class="mume-header" id="on-use-effects">On Use Effects</h2>
    <div class="row-section">
        <div class="col sixty">
            <p>Wo ist mein gro&#xDF;es Update? Wir versuchen derzeit, so viele Spezialf&#xE4;higkeiten wie m&#xF6;glich zu implementieren. Das kostet viel Zeit, wird aber sicherlich zu gro&#xDF;en Automatisierungsverbesserungen f&#xFC;hren. Das Kompendium
                2 hat einen gro&#xDF;en Umfang an Effekten und On-Use-Effekten und bald auch Aventurisches G&#xF6;tterwirken I.<br> Neben vielen anderen kleinen Dingen k&#xF6;nnen diese Effekte nun einen Widerstandswurf-Check erzeugen (z.B. nicht bet&#xE4;ubt
                werden, wenn man hinf&#xE4;llt).<br> Vor nicht allzu langer Zeit hat Aventurische Magie I dieses Update erhalten, also stellt sicher, dass ihr die Migration nutzt, um eure Spezialf&#xE4;higkeiten zu aktualisieren.</p>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/3.3.0/onuse.webp" />
        </div>
    </div>

    <h2 class="mume-header" id="on-use-effects">Tokenhotbar v2</h2>
    <div class="row-section">
        <div class="col sixty">
            <p>Die Tokenhotbar wurde verbessert. Ihr k&#xF6;nnt nun die Richtung und die Gr&#xF6;&#xDF;e der Schaltfl&#xE4;che in den Systemeinstellungen einstellen und sie an eine andere Stelle eurer Wahl ziehen. Ein Rechtsklick auf die Schaltfl&#xE4;che
                &#xE4;ndert das Layout. Durch Scrollen auf der Schaltfl&#xE4;che kann man die Gr&#xF6;&#xDF;e &#xE4;ndern. Au&#xDF;erdem enth&#xE4;lt sie jetzt zus&#xE4;tzliche Schaltfl&#xE4;chen f&#xFC;r &quot;On-Use-Effekte&quot;, Systemeffekte und
                aktive Effekte. Mit einem Linksklick kann man die Anzahl der Effekte erh&#xF6;hen und mit einem Rechtsklick die Anzahl der Effekte entfernen oder verringern. Au&#xDF;erdem kann man &#xFC;ber die Schaltfl&#xE4;che &quot;Hinzuf&#xFC;gen&quot;
                schnell neue Systemeffekte hinzuf&#xFC;gen. Dies funktioniert auch, wenn mehrere Token gleichzeitig markiert werden.</p>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/3.3.0/tokenbar.webp" />
        </div>
    </div>

    <h1 class="mume-header" id="enhancemnets">Verbesserungen</h1>
    <ul class="dsalist">
        <li>Waffen haben nun Einstellungen f&#xFC;r kritische und verpatzte Wurfschwellen</li>
        <li>&quot;Kein Ziel ausgew&#xE4;hlt&quot; f&#xFC;r Angriffsw&#xFC;rfe ist nun deutlicher</li>
        <li>Talentproben zeigen nun ausgew&#xE4;hlte Ziele an</li>
        <li>Ziele k&#xF6;nnen nun in Wurfdialogen entfernt werden.</li>
        <li>Es gibt jetzt eine Warnung im Wurfdialog, wenn mehrere Ziele ausgew&#xE4;hlt wurden</li>
        <li>Talentproben haben jetzt eine zus&#xE4;tzliche Schaltfl&#xE4;che &quot;Vergleichsprobe&quot;. So wird verhindert, dass Spieler st&#xE4;ndig Vergleichsproben ausl&#xF6;sen.</li>
        <li>Fernkampfwaffen k&#xF6;nnen jetzt Magazine haben. Du kannst jetzt deine Schrotflinte nach Dere mitnehmen (oder deinen Eisenwalder bequemer benutzen).</li>
        <li>Die Meuchelregel aus dem Kompendium 2 wurde dem System hinzugef&#xFC;gt. Man findet sie in den Angriffsdialogen.</li>
        <li>Charakterbilder aus dem Charakterbogen und Bilder aus Journalen und dem Journalbrowser k&#xF6;nnen nun direkt auf die Szene gezogen werden. Dies sollte die Erstellung von Theatre-of-Mind-Szenen vereinfachen.</li>
    </ul>

    <h1 class="mume-header" id="bugfixes">Bugfixes</h1>
    <ul class="dsalist">
        <li>Mehrere Token desselben nicht verkn&#xFC;pften Akteurs sollten nicht mehr auf einmal aktive Effekte durch Spielerinteraktion erhalten.</li>
        <li>Gl&#xFC;ckstreffer im Kampf sollten wieder richtig berechnet werden</li>
        <li>Der Sichtmodifikator f&#xFC;r absolute Dunkelheit bei Angriffen funktioniert wieder</li>
        <li>Spielleiterwillk&#xFC;r funktioniert nun auch bei Schadensw&#xFC;rfen korrekt</li>
    </ul>

</div>