<div class="mume markdown-preview  ">

    <h1 class="mume-header" id="important-enhancementsnotes">3.4.0 Wichtige Verbesserungen/Notizen (23.5.2022)</h1>

    <h2 class="mume-header" id="dsa-initiative-tracker">DSA Initiative Tracker</h2>


    <div class="row-section">
        <div class="col sixty">
            <p>DSA hat nun einen eigenen Kampftracker. Er &#xF6;ffnet sich standardm&#xE4;&#xDF;ig zu Beginn eines jeden
                Kampfes und zeigt die n&#xE4;chsten f&#xFC;nf Runden an. Man kann auf das Charakterblatt zugreifen, die
                Token anvisieren und alles andere ebenso &#xE4;hnlich wie beim Standard-Kampftracker. Au&#xDF;erdem
                erlaubt er es, Akteure zu verfolgen, die ihre Aktion zur&#xFC;ckstellen und abwarten. Er kann in den
                Einstellungen deaktiviert werden.</p>


        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/3.4.0/tracker.webp" />
        </div>
    </div>

    <h2 class="mume-header" id="aventurisches-g%C3%B6tterwirken-on-use-effekte">Aventurisches G&#xF6;tterwirken On-Use
        Effekte</h2>

    <div class="row-section">
        <div class="col sixty">
            <p>Aventurisches G&#xF6;tterwirken I wurde mit einer Vielzahl von On-Use-Effekten und active effects
                aktualisiert. Vergiss nicht, zu migrieren, um Zugriff auf die Verbesserungen zu erhalten.</p>

        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/3.3.0/onuse.webp" />
        </div>
    </div>

    <h2 class="mume-header" id="h%C3%A4ndler-v2">H&#xE4;ndler V2</h2>

    <div class="row-section">
        <div class="col sixty">
            <p>Der H&#xE4;ndler wurde um viele neue Funktionen erweitert:</p>
            <ul class="dsalist">
                <li>Jeder Artikel kann nun einen eigenen Preis haben.</li>
                <li>Gegenst&#xE4;nde k&#xF6;nnen per Drag &amp; Drop in der aktuellen Szene auf dem Boden abgelegt
                    werden, wodurch ein pl&#xFC;nderbares Beutest&#xFC;ck entsteht</li>
                <li>Beutest&#xFC;cke k&#xF6;nnen sich selbst l&#xF6;schen, sobald sie leer sind</li>
                <li>Eine optionale Chat-Nachricht kann in den Einstellungen aktiviert werden, so dass jede Transaktion
                    als Chat-Nachricht protokolliert wird.</li>
                <li>Kreaturen und Charaktere k&#xF6;nnen nun auch das H&#xE4;ndlerblatt benutzen (was auch den
                    Spielerhandel erm&#xF6;glicht)</li>
                <li>Handelspartner k&#xF6;nnen per Drag and Drop eines anderen Akteurs auf das Handelsfenster gewechselt
                    werden (z.B. wenn die Spieler mehr als einen Akteur besitzen)</li>
                <li>Gegenst&#xE4;nde k&#xF6;nnen aus dem Handelsfenster ausgeschlossen werden</li>
                <li>Die Kopfzeile der Icons hat nun Unterfunktionen (Kategorie sperren, Anzahl aller Gegenst&#xE4;nde in
                    der Kategorie erh&#xF6;hen...)</li>
                <li>Zuf&#xE4;llige Ausr&#xFC;stung hat jetzt auch ein Feld f&#xFC;r die Menge</li>
                <li>Das Kernmodul enth&#xE4;lt nun zwei Makros, die jedes Token sofort in ein Lootsheet umwandeln (so
                    k&#xF6;nnen besiegte Kreaturen gepl&#xFC;ndert werden). Die Werkstatt des Meisters erweitert diese
                    Funktionalit&#xE4;t mit mehr Details.</li>
            </ul>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/3.4.0/merchant.webp" />
        </div>
    </div>

    <h2 class="mume-header" id="vttoms-landing-page">VTToms Landing Page</h2>

    <div class="row-section">
        <div class="col sixty">
            <p>VTTom hat dem System seine Landing Page zur Verf&#xFC;gung gestellt. Verf&#xFC;gbar im Kernmodul.</p>


            </ul>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/3.4.0/landing.webp" />
        </div>
    </div>

    <h1 class="mume-header" id="enhancemnets">Verbesserungen</h1>
    <ul class="dsalist">
        <li>Talentproben k&#xF6;nnen nun als Routine gew&#xFC;rfelt werden.</li>
        <li>Der GM kann nun Ziele f&#xFC;r Spieler festlegen. Siehe auch unter den Tastenkombinationen, um einen
            benutzerdefinierten Hotkey zu setzen oder ihn &#xFC;ber die Leiste auf der linken Seite zu benutzen.</li>
        <li>Der Reaktionsdialog zeigt nun auch die Anzahl der Verteidigungen an.</li>
        <li>Bei Kreaturen mit Regeneration wird die Regeneration automatisch mit deren n&#xE4;chsten Modul-Update
            hinzugef&#xFC;gt.</li>
        <li>Wenn das Dere-Positionierungssystem aktiviert ist, k&#xF6;nnen T&#xFC;ren nur noch von nahegelegenen Tokens
            ge&#xF6;ffnet werden.</li>
        <li>Die Sammelprobe ist nun n&#xE4;her an den Regeln. Kritische W&#xFC;rfe entfernen negative Modifikatoren und
            W&#xFC;rfe k&#xF6;nnen editiert werden (z.B. &#xFC;ber Schicksalspunkte)</li>
        <li>Lichtvoreinstellungen aus dem Lichtmakro k&#xF6;nnen nun per Drag &amp; Drop zur Szene hinzugef&#xFC;gt
            werden</li>
        <li>Der Wurfdialog sollte nun Optionen f&#xFC;r Mirakel anzeigen, wenn die Religion richtig konfiguriert ist
        </li>
        <li>Der Tooltip f&#xFC;r das Wurfziel bei d20-W&#xFC;rfen wird nun ausgeblendet, wenn der Benutzer nicht der
            Besitzer des w&#xFC;rfelnden Akteurs ist</li>
        <li>Rabenkrieg 2 hat eine zus&#xE4;tzliche Karte erhalten - Das Kriegslager (v3.4.0). Man kann es in der
            Schlacht um Trus oder als Lager zwischen den Szenen verwenden.</li>
        <li>Rabenkrieg 2 hat jetzt auch den Darsteller &quot;Daria&quot;.</li>
        <li>Die Werkstatt des Meisters kann nun per Button und Chatbefehl eine Liste von Beispielnamen anzeigen (z.B.
            bei der Charaktererstellung) und hat einige kleinere Verbesserungen erhalten (u.a. Unterst&#xFC;tzung von
            Beutetransformation, v3.4.0)</li>


    </ul>

    <h1 class="mume-header" id="bugfixes">Bugfixes</h1>
    <ul class="dsalist">
        <li>Der Kulturassistent f&#xFC;gt nicht mehr alle Sprachen als Muttersprache hinzu.</li>
        <li>Krit &amp; Patzer f&#xFC;r unbewaffnete Angriffe sollten wieder funktionieren</li>
        <li>Einige On-Use Effekte im Grundregelwerk gefixt (v3.4.0)</li>
    </ul>

</div>