<div>
    <h1 class="mume-header" id="wichtige-erweiterungen">4.0.3 Wichtige Verbesserungen/Notizen (30.8.2022)</h1>

    <h2 class="mume-header" id="swap-hands-modifikatoren">Swap Hands Modifikatoren</h2>

    <p>Einh&#xE4;ndige Waffen k&#xF6;nnen nun auch zweih&#xE4;ndig gef&#xFC;hrt werden und zweih&#xE4;ndige Waffen
        umgekehrt. Alle Modifikatoren sind enthalten. Du darfst einmal die Hand wechseln, wenn du im Kampf an der Reihe
        bist. Es ist jetzt m&#xF6;glich, einen Schild mit einem Speer zu benutzen!</p>
    <h2 class="mume-header" id="neuer-gegenstand-information">Neuer Gegenstand &quot;Information&quot;</h2>

    <p>Der neue Gegenstandstyp &quot;Information&quot; ist jetzt verf&#xFC;gbar. Er kann einen W&#xFC;rfelwurf starten,
        um zu bestimmen, wie viele Informationen ein Benutzer &#xFC;ber ein bestimmtes Thema wei&#xDF;. Der Spieler oder
        der Spielleiter (konfigurierbar in den Einstellungen) erh&#xE4;lt je nach Ergebnis des Wurfes eine
        gefl&#xFC;sterte Nachricht und kann die Informationen dann nach eigenem Ermessen verarbeiten (z.B. den anderen
        Spielern mitteilen). Wir haben alle Kreaturen aktualisiert, um diese Informationen, wo n&#xF6;tig, einzubauen.
        Sp&#xE4;ter werden wir auch alle Pflanzen aktualisieren.</p>
    <h2 class="mume-header" id="artefakt-erstellung">Artefakt-Erstellung</h2>

    <p>Das Kernmodul bringt nun einen Artefakterstellungshelfer in das Spielermen&#xFC;. Er hilft bei der Erstellung von
        magischen Artefakten, indem er alle W&#xFC;rfelmodifikatoren, Kosten und andere wichtige Teile des Prozesses
        anzeigt. In Zukunft werden wir wahrscheinlich weitere Hilfen f&#xFC;r komplexe Regelelemente wie dieses
        hinzuf&#xFC;gen.</p>
    <h2 class="mume-header" id="aktive-effekte-f%C3%BCr-waffen-und-andere-gegenst%C3%A4nde">Aktive Effekte f&#xFC;r
        Waffen und andere Gegenst&#xE4;nde</h2>

    <p>Aktive Effekte k&#xF6;nnen nun auch andere Gegenst&#xE4;nde modifizieren. Ihr k&#xF6;nnt nun z.B. einen Ring
        erstellen, der eure bevorzugte Waffe modifiziert und den Attackewert erh&#xF6;ht.<br>
        Dies wird f&#xFC;r Sonderfertigkeiten f&#xFC;r Traditionsartefakte und &#xE4;hnliches sehr n&#xFC;tzlich sein.
        Wir werden diese zu einem sp&#xE4;teren Zeitpunkt in die Kompendien aufnehmen. Felder, die durch einen solchen
        aktiven Effekt ver&#xE4;ndert wurden, k&#xF6;nnen nicht mehr manuell ge&#xE4;ndert werden, bis der Effekt
        verschwunden ist!<br>
        Beispielschl&#xFC;ssel: &quot;@meleeweapon.Dolch.system.atmod.value, mode: add, value 2 - w&#xFC;rde den
        Angriffswert jedes Gegenstandes namens Dolch vom Typ meleeweapon um 2 erh&#xF6;hen</p>
    <h1 class="mume-header" id="erweiterungen">Verbesserungen</h1>

    <ul class="dsalist">
        <li>Aktive Effekte von Sonderfertigkeiten, Vor- und Nachteilen werden nun entsprechend ihrer Stufe x-mal
            angewendet</li>
        <li>Das Meistermenü hat jetzt einen Button, um alle verfolgten Akteure gleichzeitig auf das Spielfeld zu
            ziehen</li>
        <li>Die Bibliothek hat jetzt einen Ladebalken, damit man wei&#xDF;, was gerade passiert</li>
        <li>Man kann nun Akteure aus dem Meistermen&#xFC; direkt auf das Spielfeld ziehen</li>
        <li>Die Kampfregeneration von Kreaturen kann jetzt deaktiviert werden (z.B. wenn man den Werwolf mit einem
            Silberschwert trifft)</li>
        <li>Die Situationsbedingten Modifikatoren sollten nun einen hilfreicheren Tooltip haben</li>
        <li>Traditionsartefaktsonderfertigkeiten haben nun ihr jeweiliges Artefakt als Symbol, damit sie in der
            Bibliothek leichter gefunden werden k&#xF6;nnen</li>
        <li>Der DSA-Journalblatt-Stil kann nun gr&#xF6;&#xDF;tenteils durch Umschalten des Journalblattes deaktiviert
            werden</li>
        <li>Ein paar Touren wurden hinzugef&#xFC;gt</li>
        <li>Die Tooltips wurden auf den v10-Standardstil migriert</li>
        <li>Regenerationsw&#xFC;rfe k&#xF6;nnen nun selektiv ausgew&#xE4;hlt werden (z.B. nur LeP, AsP)</li>
        <li>Akteure haben nun eine Methode zur Erkennung der Kreaturenklasse, die z.B. zur Definition von Blutfarben
            f&#xFC;r das Modul Splatter verwendet werden kann. Das Grundregelwerk enth&#xE4;lt ein vordefiniertes Makro,
            um diese Farben zu setzen (Dank an VTTom). Ihr k&#xF6;nnt es nach euren W&#xFC;nschen anpassen.</li>
        <li>Wir haben ein paar weitere Icons f&#xFC;r Kartennotizen hinzugef&#xFC;gt</li>
        <li>Eine automatische Aufforderung f&#xFC;r eine Selbstbeherrschungsprobe wird nun in den Chat gesendet, wenn
            ein Akteur die Schmerzstufe 4 erh&#xE4;lt, so dass er versuchen kann, nicht handlungsunf&#xE4;hig zu werden
            (dies kann in den Optionen deaktiviert werden)</li>
        <li>DSA ist jetzt gebundelt und komprimiert, was die Ladezeit verbessern sollte (ein wenig experimentell)</li>
        <li>Das Aktivieren oder Deaktivieren des Zugriffs auf B&#xFC;cher f&#xFC;r die Spieler zeigt oder versteckt nun
            auch die dazugeh&#xF6;rigen Kompendien</li>
        <li>Die automatische Umbenennung von Token, die auf dem Spielfeld abgelegt werden, kann nun ohne Nummerierung
            durchgef&#xFC;hrt werden</li>
        <li>Das Lichtmakro im Grundregelwerk hat nun alle Lichteinstellungen zur Verf&#xFC;gung. Au&#xDF;erdem kann das
            Token Player HUD nun mit eigenen Lichtkonfigurationen angepasst werden.</li>
        <li>GM-Willk&#xFC;r funktioniert nun auch f&#xFC;r Trefferzonen</li>
        <li>Die &quot;Wusstest du schon&quot;-Nachricht wird nun nach 8s (statt 4) ausgeblendet und das Ausblenden kann
            komplett gestoppt werden. Nach dem Stoppen kann man weitere Meldungen anfordern. Dr&#xFC;ckt einfach den
            richtigen Knopf.</li>
        <li>Ini- und Bewegungsmodifikatoren f&#xFC;r Zonenr&#xFC;stungen sollten nun korrekt berechnet werden (Dank an
            Qowy)</li>
        <li>Die Erkennung des Kreaturentyps funktioniert jetzt auch f&#xFC;r das Blatt &quot;npc&quot; und
            &quot;Charakter&quot; (statt nur &quot;Kreatur&quot;). Denken Sie daran, dass das Feld &quot;Spezies&quot;
            schreibgesch&#xFC;tzt ist, da die Spezies nur auf den Charakter gezogen werden sollte, um sicherzustellen,
            dass alle Basisattribute richtig gesetzt sind. Damit die Erkennung funktioniert, muss ein active effect
            erstellt werden, der den Namen der Spezies &#xFC;berschreibt (dies ist in den Bedingungen f&#xFC;r
            Lykanthropie und Werkreatur enthalten).</li>
        <li>Statuseffekte von Akteuren können jetzt per drag and drop auf andere Akteure übertragen werden (icon ziehen)</li>
    </ul>
    <h1 class="mume-header" id="bugfixes">Bugfixes</h1>

    <ul  class="dsalist">
        <li>Parierw&#xFC;rfe sollten nun korrekt den Token-Namen anstelle des Akteursnamens anzeigen.</li>
        <li>Die Berechnung der Schadensmodifikatoren von Werwesen wurde korrigiert.</li>
        <li>Korrigierte Stufendarstellung der allgemeinen Spezialf&#xE4;higkeiten f&#xFC;r das Charakterblatt</li>
        <li>Automatisches Schwenken auf die Spielfigur im Kampf sollte nicht mehr so exzessiv auftreten</li>
    </ul>
</div>