<h1 class="mume-header" id="wichtige-erweiterungen">Wichtige Erweiterungen</h1>

<h2 class="mume-header" id="responsive-upgrades">Responsive Upgrades</h2>

<p>Einige Teile des Charakterbogens wurden &#xFC;berarbeitet, f&#xFC;r ein besseres mobile/tablet layout. Du kannst das Fenster des Charakterbogens verkleinern und das Layout wird sich an die neuen Grenzen anpassen. Auf diese Weise k&#xF6;nnt ihr das Spiel auch auf kleineren Bildschirmen genie&#xDF;en. Wir zielen im Moment vor allem auf Tablets ab und haben dort bereits ziemlich gute Ergebnisse gesehen. Wir beabsichtigen, die Unterst&#xFC;tzung f&#xFC;r Tablets zu erweitern, einschlie&#xDF;lich spezieller Widgets, die das Spielen an einem Tisch erm&#xF6;glichen. Das vorgesehene Setup f&#xFC;r den Moment ist ein Spielleiter mit einem normalen Laptop oder Desktop (weil viele Funktionen eine Maus erfordern) und Spieler, die &#xFC;ber Tablets w&#xFC;rfeln und Charaktere erstellen k&#xF6;nnen, so dass man ein hybrides Setup am Tisch machen kann.<br>
Foundry V11 &#xE4;ndert hier ein paar Dinge, so dass es leider nicht sofort nach der Ver&#xF6;ffentlichung von V11 funktionieren wird.</p>
<h2 class="mume-header" id="charaktergenerator">Charaktergenerator</h2>

<p>Wir haben uns entschlossen, eine Unterst&#xFC;tzung f&#xFC;r die einfache und gef&#xFC;hrte Charaktererstellung hinzuzuf&#xFC;gen.<br>
Der neue Charaktergenerator ist ein Charakterbogen, der nur f&#xFC;r den Akteurstyp &quot;Charakter&quot; verf&#xFC;gbar ist. Du kannst ihn aktivieren, indem du den Bogen-Typ des Charakters &#xE4;nderst oder den entsprechenden Button bei einem neuen Charakter anklickst (er wird nur f&#xFC;r Charaktere ohne Spezies, Profession und Kultur angezeigt).<br>
Der Bogen selbst ist vor allem f&#xFC;r Neueinsteiger in das Schwarze Auge gedacht. Er f&#xFC;hrt den Spieler durch alle wichtigen Schritte und gibt Erkl&#xE4;rungen sowie einige Grenzen und Anforderungen f&#xFC;r Attribute und Fertigkeiten an. Im Laufe der Entwicklung dieses Tools (puh, ich wei&#xDF;, warum ich nicht fr&#xFC;her damit angefangen habe...) haben wir auch den Charakterrechner und einige der Berechnungen verbessert, so dass er pr&#xE4;ziser sein sollte. Der Bogen bietet auch ein paar Vorschl&#xE4;ge f&#xFC;r den Erstellungsprozess. Das Hinzuf&#xFC;gen von Ausr&#xFC;stungsgegenst&#xE4;nden zu dem Blatt, w&#xE4;hrend es aktiviert ist, wird auch automatisch den Preis f&#xFC;r diesen Gegenstand bezahlen oder das Hinzuf&#xFC;gen verweigern, wenn nicht mehr genug Geld vorhanden ist. Das Tool f&#xFC;gt immer Kultur- und Professionspakete hinzu.<br>
Besonders bemerkenswert f&#xFC;r Anf&#xE4;nger ist das Feld &quot;gesch&#xE4;tzte Erfolgschance&quot; f&#xFC;r eine Qualit&#xE4;tsstufe bei Fertigkeiten, denn Anf&#xE4;nger haben in der Regel keine Ahnung, was all diese Zahlen bedeuten und ob sie wirklich gut in der entsprechenden Fertigkeit sind.<br>
<strong>Disclaimer: Bei der Entwicklung des Systems wurde der Schwerpunkt auf die Erleichterung des Spielflusses gelegt. Ein Charaktergenerator ist nicht Teil unserer Aufgabe und die M&#xF6;glichkeiten und Anforderungen an einen Charaktergenerator sind unendlich und sehr aufw&#xE4;ndig. Wir wollen und k&#xF6;nnen einen vollst&#xE4;ndigen Charaktergenerator nicht unterst&#xFC;tzen, so dass einige W&#xFC;nsche und Tickets zu diesem Thema m&#xF6;glicherweise nie eine Antwort erhalten werden.</strong><br>
Dieser Generator kann nicht die Voraussetzungen f&#xFC;r besondere F&#xE4;higkeiten und Vor-/Nachteile &#xFC;berpr&#xFC;fen - das m&#xFC;sst ihr selbst tun.<br>
Wenn du einen vollwertigen Charaktergenerator brauchst, solltest du immer noch sehr fortgeschrittene Tools wie Optolith oder The Dark Aid verwenden.<br>
Dieses Feature ben&#xF6;tigt das dsa5-core Modul.</p>
<h2 class="mume-header" id="master-token-hotbar-verbessert">Master-Token-Hotbar verbessert</h2>

<p>Die Token-Hotbar hat nun ein eigenes Konfigurationsmen&#xFC; in den Einstellungen. Neben einigen kleineren Optionen wie dem Ausblenden der Leiste findet der Spielleiter dort auch Einstellungen zum Ein- und Ausblenden einiger Token-Hotbar-Funktionen des Spielleiters sowie zum vollst&#xE4;ndigen Deaktivieren dieser Funktionen. Optionale Funktionen wie die Nahrungssuche, die Jagd und die Pflanzensuche sind nun auch &#xFC;ber die Hotbar des Spielleiters verf&#xFC;gbar.</p>
<h2 class="mume-header" id="crafting-update">Crafting Update</h2>

<p>Wir haben verschiedene Hilfsmittel f&#xFC;r alle m&#xF6;glichen Handwerksmethoden hinzugef&#xFC;gt. Ihr k&#xF6;nnt sie im Spielermen&#xFC; finden. In der Hotbar des Meisters und als Makro.</p>
<h3 class="mume-header" id="alchimie-hilfe">Alchimie-Hilfe</h3>

<p>Das Spielermen&#xFC; enth&#xE4;lt nun einen kleinen Helfer f&#xFC;r das Brauen von Tr&#xE4;nken. Stelle dazu sicher, dass ein Akteur im Spielermen&#xFC; aktiv ist. Wenn du ein Spieler bist, sollte es bereits dein Charakter sein, aber du kannst auch einen anderen Akteur, den du besitzt, auf die App per drag and drop ziehen. Ziehe  dann auch ein Rezept auf die App und schon kannst du loslegen. Aber Vorsicht, fehlgeschlagene alchemistische Experimente k&#xF6;nnen Chaos verursachen! Der Gegenstand wird mit der entsprechenden Qualit&#xE4;tsstufe im Inventar des Alchemisten erstellt.<br>
Diese Funktion erfordert das Modul dsa5-core.</p>
<h3 class="mume-header" id="nahrungssuche-und--jagd">Nahrungssuche und -jagd</h3>

<p>Der Spielleiter kann nun &#xFC;ber die Token-Hotbar oder ein Makro einen Jagd- oder Nahrungssuchprozess einleiten. Er wird dich durch die notwendigen Schritte leiten. Das Ergebnis der Jagd kann aus dem Chat auf den Akteur gezogen werden. Du kannst alle erforderlichen Modifikatoren einstellen. Die Menge der Rationen und der Zeitbedarf werden automatisch berechnet.<br>
Die Pflanzensuche aus dem Herbarium wird ebenfalls in die Token-Hotbar aufgenommen.<br>
Diese Funktion ben&#xF6;tigt das Modul dsa5-compendium.</p>
<h3 class="mume-header" id="die-schmiede">Die Schmiede</h3>

<p>Dank Teliogeos exzessiver Vorarbeit haben wir nun auch einen Helfer f&#xFC;r das Schmieden von Waffen und R&#xFC;stungen. Er ist ebenfalls &#xFC;ber das Spielermen&#xFC; zu finden. Stellt sicher, dass dort ein Schmied aktiv ist (siehe Alchemie-Helfer) und nehmt eine beliebige R&#xFC;stung/Waffe als Rezept per Drag and Drop. Du kannst dann das Material, die Technik und die gew&#xFC;nschten Modifikationen ausw&#xE4;hlen. Das Tool berechnet das ben&#xF6;tigte Zeitintervall und liefert einen Sammelprobe, die dem Akteur hinzugef&#xFC;gt werden kann. Handwerk ist eine Sammelprobe, so dass der Handwerker bis zu 7 Proben durchf&#xFC;hren m&#xFC;ssen, die jeweils ein Zeitintervall kosten, um 10 Qualit&#xE4;tsstufen zu erreichen und das Objekt fertigzustellen. Werden nicht alle Qualit&#xE4;tsstufen innerhalb der maximal erlaubten Anzahl von Versuchen fertiggestellt, verdirbt das Material und der Herstellungsprozess schl&#xE4;gt fehl.<br>
Der Spielleiter erh&#xE4;lt au&#xDF;erdem einen Vorschlag f&#xFC;r die gesch&#xE4;tzten Herstellungskosten. Die Materialkosten werden berechnet, indem das Gewicht des Basisgegenstands mit den Kosten f&#xFC;r 1 Einheit (Stein) des Materials multipliziert wird. Da die Ausr&#xFC;stung aus verschiedenen Materialien besteht (z.B. hat eine R&#xFC;stung nicht nur eine Stahlplatte, sondern auch Lederriemen), ist diese Berechnung nur als grober Richtwert zu verstehen. Auch die Kosten f&#xFC;r einen bezahlten Arbeiter (qualifiziert und meisterhaft) werden f&#xFC;r jedes Intervall berechnet. Du wirst eine Kostenspanne sehen, z.B. 40-72, was 40 Silbertaler bis 72 f&#xFC;r einen qualifizierten Arbeiter bedeutet. Denke daran, dass jedes zus&#xE4;tzliche erforderliche Intervall w&#xE4;hrend der Sammelprobe auch die Kosten um diesen Wert erh&#xF6;ht.<br>
Sobald die Sammelprobe des Akteurs abgeschlossen ist, wird er eine Chat-Nachricht mit dem fertigen Gegenstand ver&#xF6;ffentlichen. Du kannst den Gegenstand dann auf den gew&#xFC;nschten Akteur ziehen.<br>
Auf diese Weise kann der Spielleiter auch die richtigen Modifikatoren f&#xFC;r die Spieler vorbereiten.<br>
Alternativ kann man den modifizierten Gegenstand auch einfach sofort fertigstellen, ohne ihn zu erw&#xFC;rfeln (z.B. wenn die Spieler einen Gegenstand bei einem bekannten Schmied gekauft haben). Die angewandten Modifikatoren werden der Beschreibung des Gegenstandes hinzugef&#xFC;gt.<br>
Diese Funktion ben&#xF6;tigt das Modul dsa5-compendium.</p>
<h2 class="mume-header" id="schauspielernotizen---again">Schauspielernotizen - AGAIN</h2>

<p>Dies war bereits ein Feature in vergangenen Tagen. Die Foundry-Updates haben es nicht gut mit ihm gemeint... aber jetzt ist es wieder da! Der Spielleiter kann den Spielern begrenzten Zugriff auf wichtige NSCs geben. Die Spieler haben dann die M&#xF6;glichkeit, einen speziellen Notizbereich zu diesem NSC zu bearbeiten. So k&#xF6;nnen sie Informationen direkt zum NSC hinzuf&#xFC;gen, anstatt ein extra Journal zu f&#xFC;hren.<br>
So k&#xF6;nnen Sie eine sch&#xF6;ne Sammlung von &quot;Dramatis Personae&quot; erstellen.</p>
<h2 class="mume-header" id="st%C3%B6bern-modus">St&#xF6;bern-Modus</h2>

<p>Die Bibliothek hat jetzt einen St&#xF6;bern-modus. Aktiviere ihn, indem du auf den Vergr&#xF6;&#xDF;ern-Button neben der Suchleiste klickst. Er erm&#xF6;glicht es, gefilterte Inhalte leichter zu lesen, so dass du besser lernen und neue Inhalte finden kannst. Dieses Ding ist dazu gedacht das Lesen am PC angenehmer zu gestalten. Immer noch der erste Versuch... aber mehr kommt. Vergiss nicht, auch die erweiterte Suche zu nutzen.</p>
<h1 class="mume-header" id="erweiterungen">Erweiterungen</h1>

<ul class="dsalist">
<li>Der Angriffsdialog zeigt nun einen Hinweis zum Ausweichen und Parieren an, wenn der angreifende Gegner gro&#xDF; oder riesig ist.</li>
<li>TDE-Karten, die aus einem Kompendium importiert werden, zeigen nun eine Warnung an, dass sie m&#xF6;glicherweise nicht richtig initialisiert werden, wenn sie nicht &#xFC;ber den Journalbrowser importiert werden.</li>
<li>Prinzipien und Verpflichtungen sollten nun ihre Abenteuerpunktkosten richtig berechnen (nur die h&#xF6;chsten Kosten werden ber&#xFC;cksichtigt)</li>
<li>Der Spieler sieht den ge&#xE4;nderten Preis auf den Gegenst&#xE4;nden der H&#xE4;ndler nur, wenn er das Detailblatt des Gegenstands &#xF6;ffnet. Zuvor konnte er dort den Grundpreis sehen.</li>
<li>Der Spielleiter hat nun einen zus&#xE4;tzlichen Button in der Kopfzeile der Akteursbl&#xE4;tter, mit dem er in die eingeschr&#xE4;nkte Ansicht des Blattes wechseln kann. Die eingeschr&#xE4;nkte Ansicht ist das, was Spieler sehen k&#xF6;nnen, wenn sie die Berechtigung &quot;eingeschr&#xE4;nkt&quot; f&#xFC;r diesen Akteur haben.</li>
<li>Effekte k&#xF6;nnen nun mit einer Zeit und einem Grund auf dem Charakterblatt hinzugef&#xFC;gt werden, indem man mit der rechten Maustaste auf die Effekt-Auswahlliste auf der Status-Registerkarte klickt. Dies ist &#xE4;hnlich wie bei der Tokenhotbar, die diese Funktion vor kurzem erhalten hat.</li>
<li>Man kann nun die Breite des TDE-Kampftrackers &#xE4;ndern. Standardm&#xE4;&#xDF;ig werden nur die n&#xE4;chsten 5 Z&#xFC;ge angezeigt, um Unordnung auf dem Bildschirm zu vermeiden. Wenn du aber mehr Informationen ben&#xF6;tigst, kannst du die Anzahl erh&#xF6;hen.</li>
<li>Die Initiative hat nun einen zus&#xE4;tzlichen Wert von 1d99*0.0001. Dies dient dazu, Gleichst&#xE4;nde zwischen gleichen Initiativw&#xFC;rfen zu entscheiden. Die Grundregeln sehen vor, dass 1d6 so lange gew&#xFC;rfelt wird, bis ein Sieger gefunden ist. Dies ist technisch schwierig und besonders bei gro&#xDF;en K&#xE4;mpfen sehr ineffektiv. Zur Erinnerung: Die Initiative ist nun definiert als:<br>
1d6 + Basis-Initiativwert + Basis-Initiativwert * 0.01 + 1d99 * 0.0001</li>
<li>Die Wundschwellenregel im Kompendium kann nun deaktiviert werden, so dass die Schaltfl&#xE4;chen f&#xFC;r den Effekt nicht mehr im Kampf erscheinen.</li>
<li>Verzauberte Gegenst&#xE4;nde w&#xFC;rfeln nun mit dem Namen des Gegenstandes statt mit &quot;Alrik&quot;.</li>
<li>Es gibt einen neuen Hook f&#xFC;r die Konfiguration von Sounds, die z.B. bei Interaktionen mit dem Inventar-Interface und bei Geldangelegenheiten abgespielt werden. Ein Modul kann nun die Pfade zu diesen Dateien &#xFC;berschreiben, so dass man es vermeiden kann, die gesamten Audio-Bundles des Spiels zu installieren.</li>
</ul>
<pre data-role="codeBlock" data-info="javascript" class="language-javascript"><span class="token maybe-class-name">Hooks</span><span class="token punctuation">.</span><span class="token method function property-access">call</span><span class="token punctuation">(</span><span class="token string">&apos;setDefaultDSASounds&apos;</span><span class="token punctuation">,</span> <span class="token parameter">soundPaths</span> <span class="token arrow operator">=&gt;</span> <span class="token punctuation">{</span>
    <span class="token comment">//Pfade &#xE4;ndern</span>
<span class="token punctuation">}</span><span class="token punctuation">)</span>
</pre><ul>
<li>Das Grundregelwerk Modul enth&#xE4;lt ein neues Makro zum Sortieren von Kompendien in Ordnern</li>
</ul>
<h1 class="mume-header" id="fehlerbehebungen">Fehlerbehebungen</h1>

<ul class="dsalist">
<li>Die Standard-Schriftgr&#xF6;&#xDF;e f&#xFC;r den Journal-Browser und die Journale sollte nun korrekt funktionieren.</li>
<li>Die Spezies Elf kostet nun -12 AP statt 18 AP. Auf diese Weise tragen die kostenlosen Vorteile &quot;Zweistimmiger Gesang&quot; und &quot;Zauberer&quot; korrekt zu den Gesamtkosten von 18 AP bei.</li>
<li>R&#xFC;stungen in Taschen sollten ihr Gewicht nun korrekt berechnen</li>
<li>Der Standard Kampftracker sollte nun Spielern nicht mehr mehrfache Aktionen von Kreaturen anzeigen</li>
</ul>