<div class="mume markdown-preview  ">

  <h1 class="mume-header" id="wichtige-neue-features">2.3.0 Wichtige neue Features (5.10.2021)</h1>
  <div class="row-section">
    <div class="col sixty">
      <h2 class="mume-header" id="verbesserung-der-suchfilter-in-der-bibliothek">Active Effects Helper Item
      </h2>

      <p>SLs können nun einen speziellen Gegenstand namens "Effekt-Container" erstellen. Der einzige Zweck dieses Gegenstandes
      ist die Speicherung von Aktiven Effekten, da Foundry keine Standardoption dafür bietet. SLs können mehrere Aktive
      Effekte zu diesem Element hinzufügen. Diese Effekte werden beim Drag and Drop in einen Actor kopiert, was für häufig
      verwendete Effekte nützlich ist. Dieser Workaround könnte in Zukunft entfernt werden, sobald Foundry eine bessere
      Basisimplementierung dieser Funktion hat.
      </p>
    </div>
    <div class="col fourty">
      <img src="systems/dsa5/lazy/patchimages/2.3.0/effectcontainer.webp">
    </div>
  </div>
  <div class="row-section">
    <div class="col sixty">
      <h2 class="mume-header" id="journalbrowser-verbesserungen">Gruppenschicksalspunkte</h2>

      <p>Das Menü des Meisters enthält jetzt Gruppen Schicksals-Punkte. Diese können wie normale Schicksalspunkte über das
      Chat-Kontextmenü verwendet werden. Schicksalspunkte, die man für den Pool verwenden will, muss man manuell aus den
      Actors entfernen. Du kannst dies tun, indem du einen negativen Modifikator zum maximalen Schicksalspunktewert auf dem
      Charakterblatt hinzufügst (dies kann nicht automatisch verfolgt werden, da das Tool nicht weiß, welche Charaktere dem
      Pool Punkte hinzufügen).</p>
    </div>
    <div class="col fourty">
      <img src="systems/dsa5/lazy/patchimages/2.3.0/gruppenschips.webp">
    </div>
  </div>
  <div class="row-section">
    <div class="col sixty">
      <h2 class="mume-header" id="journalbrowser-verbesserungen">Waffenvergiftung & Talisman</h2>

      <p>Du kannst nun deine Nahkampfwaffe vergiften. Ziehe dazu ein Gift auf das geöffnete Gegenstandsblatt einer Nahkampfwaffe.
      Bei einem erfolgreichen Angriff erscheint ein Button im Chat, um die Giftprobe auszuführen. Jedes Mal, wenn du die
      Giftprobe bestehst, wird eine Ladung des Giftes entfernt. Setzt die Option "Permanent", wenn ihr nicht wollt, dass bei
      der Verwendung von Gift Ladungen abgezogen werden (zum Beispiel bei feindlichen Kreaturen oder Spezialwaffen).
      Auch das Erstellen von Talismanen ist nun auf dieselbe Weise möglich wie das Verzaubern. Der einzige Unterschied besteht
      darin, dass sie sich nie verbrauchen, wenn sie auf permanent eingestellt sind, und dass sie nicht wieder aufgeladen
      werden müssen.</p>
    </div>
    <div class="col fourty">
      <img src="systems/dsa5/lazy/patchimages/2.3.0/gift.webp">
    </div>
  </div>
  <h1 class="mume-header" id="verbesserungen">Verbesserungen</h1>

  <ul>
    <li>Der Parierwert von Waffen wird nun &#xFC;ber das prim&#xE4;re Attribut der Waffe berechnet und nicht mehr &#xFC;ber
      die Kampffertigkeit. Man kann nun spezielle Waffen mit z.B. Scharfsinn als prim&#xE4;res Attribut erstellen.</li>
    <li>Das Anwenden von Schaden &#xFC;ber das Chat-Kontextmen&#xFC; hinterl&#xE4;sst nun einen kleinen Indikator, der den
      Spielleiter daran erinnert, dass der Schaden bereits angewendet wurde.</li>
    <li>Actor Flags werden bei der Erstellung von Actors nicht mehr gel&#xF6;scht, um Module von Drittanbietern besser zu
      unterst&#xFC;tzen.</li>
    <li>Fehlende Initialisierungstexte f&#xFC;r Abenteuer sollten nun wieder korrekt angezeigt werden.</li>
    <li>W&#xFC;rfel k&#xF6;nnen nun mit individuellen Dice so nice Farbs&#xE4;tzen im Konfigurationsmen&#xFC; konfiguriert
      werden.</li>
    <li>Die optionale Regel &quot;weniger Regeneration&quot; kann nun &#xFC;ber die Konfiguration aktiviert werden.</li>
    <li>Der Journalbrowser verf&#xFC;gt nun &#xFC;ber einen kleinen Pfeilbutton zum Ausblenden des Inhaltsverzeichnisses.
      Dies kann die Lesbarkeit von gro&#xDF;en Textbl&#xF6;cken verbessern.</li>
    <li>Man kann nun permanente und tempor&#xE4;re Modifikatoren zum Regenerationswurf hinzuf&#xFC;gen. Um dies zu tun,
      suche deine LP-Konfiguration auf dem Attribute/Spezialf&#xE4;higkeiten-Teil des Charakterbogens und klicke auf den
      Namen. Dadurch wird das entsprechende Men&#xFC; ge&#xF6;ffnet. ACHTUNG: Tempor&#xE4;re Modifikatoren werden beim
      n&#xE4;chsten Regenerationswurf gel&#xF6;scht.</li>
    <li>ActiveEffects k&#xF6;nnen nun Gruppen von Fertigkeitspr&#xFC;fungen modifizieren (z.B. liturgische Ges&#xE4;nge,
      Zauber).</li>
    <li>Normale W&#xFC;rfe &#xFC;ber Chat-Befehle haben nun eine Kontextoption, um Schaden zuzuf&#xFC;gen (z.B. wenn ein
      Spieler zuf&#xE4;llig vom Blitz getroffen wird und man &#xFC;ber den Chat Schaden zuf&#xFC;gen m&#xF6;chte).</li>
    <li>Der Kampfreaktionsdialog wurde optimiert, um die Anzahl der erforderlichen Klicks um eins zu reduzieren. Deine
      Maushand wird es dir danken.</li>
    <li>Zauberspr&#xFC;che zeigen nun die Wirkdauer im Charakterblatt und im Kampf-Tracker an.</li>
    <li>Die Tokenleiste zeigt nun immer mindestens einen Zauber im Kampf an (wenn der Charakter ein Gesegneter oder Magier
      ist). Diese Schaltfl&#xE4;che kann zu einem Untermen&#xFC; erweitert werden, in dem alle Zauberspr&#xFC;che angezeigt
      werden. So hat man Zugang zu Zaubern, die nicht nur f&#xFC;r Schaden gedacht sind (z.B. Axxeleratus).</li>
    <li>Die Zust&#xE4;nde Blutung und Verbrennung wenden nun automatisch in jeder Runde Schaden an (nur im Kampf!).</li>
    <li>Das Hauptmen&#xFC; kann nun einen Standard-Sichtmodifikator auf Kampfw&#xFC;rfe anwenden, der von der Dunkelheit der
      Szene abh&#xE4;ngt (Dunkelsicht wird automatisch in die Berechnung einbezogen).</li>
    <li>Das H&#xE4;ndlerblatt hat jetzt eine Option f&#xFC;r ein einfaches Charakterblatt f&#xFC;r epische und
      legend&#xE4;re Helden (wie einen K&#xF6;nig oder deinen Ehepartner), die keine wirklichen Werte haben und nur ein Bild
      und einige Hintergrundinformationen ben&#xF6;tigen. Dies ist noch kein vollwertiges Feature und wird wahrscheinlich
      noch wachsen.</li>
    <li>Eine kurze &quot;Wusstest du schon?&quot;-Meldung nach dem Laden wurde hinzugef&#xFC;gt, um den Spielern zu helfen,
      unser System besser zu nutzen.</li>

  </ul>
  <h1 class="mume-header" id="bugfixes">Bugfixes</h1>

  <ul>
    <li>Gegenstandssets sollten wieder richtig funktionieren (/Pakete) (erfordert das n&#xE4;chste Coremodul-Update!).</li>
    <li>Die Option zum Erweitern der Modifikatorenliste f&#xFC;r W&#xFC;rfe sollte nun wie vorgesehen funktionieren.</li>
    <li>Ausr&#xFC;stungsgegenst&#xE4;nde sollten nun w&#xE4;hrend der Migration in Containern bleiben.</li>
    <li>Bei der Charaktererstellung hinzugef&#xFC;gte Muttersprachen haben jetzt keine Punktekosten. Dies f&#xFC;hrt zur
      korrekten Berechnung der freien Sprachpunkte, die in Professionen enthalten sind.</li>
    <li>Ein kleines Problem mit der Darstellung von Dice so Nice im Konfigurationsmen&#xFC; wurde behoben.</li>
    <li>Kampfzauber sollten nun den korrekten -4 Modifikator auf Ausweichen anwenden.</li>

  </ul>


  <h1 class="mume-header" id="patch-221">Patch 2.2.1</h1>

  <h2 class="mume-header" id="verbesserungen-1">Verbesserungen</h2>

  <ul>
    <li>Gruppensammelproben wurden etwas verbessert.</li>
    <li>Es gibt nun ein weiteres Notizfeld, welches nur f&#xFC;r den Besitzer des Charakterblatt sichtbar ist (damit kann
      man z.B. die Hintergrundgeschichte vor anderen Spielern verbergen).</li>
    <li>Webm Token sollten im Chat nun richtig angezeigt werden.</li>
    <li>Der Ausweichwert kann nun zum Verteidigungswert umgeschalten werden f&#xFC;r Kreaturen. Dadurch bekommen diese den
      Malus durch mehrfache Verteidigungen nicht mehr. Wir aktualisieren alle betroffenen Kreaturen zu einem sp&#xE4;teren
      Zeitpunkt.</li>
  </ul>
  <h2 class="mume-header" id="bugs-1">Bugs</h2>

  <ul>
    <li>Das Wiederholen des Schadenswurfs bei Zaubern sollte wieder richtig funktionieren.</li>
    <li>Professionen mit Eigenschaftsvorraussetzzungen auf NSC Charakterbl&#xE4;tter zu ziehen, sollte nun die
      modifizierten Eigenschaftswerte richtig anzeigen.</li>
    <li>Die Sonderfertigkeit &quot;Angriff verbessern&quot; sollte nun richtig funktionieren.</li>
    <li>Tricks und Ausbildungsaufs&#xE4;tze f&#xFC;r Tiere sollten nun dem Kreaturenblatt hinzuf&#xFC;gbar sein (fehlende
      Active Effects brauchen dennoch ein Update des Tiergef&#xE4;hrten Moduls zu einem sp&#xE4;teren Zeitpunkt).</li>
    <li>Die Funktion von Merkmalskenntnis und -focus sollten nicht mehr vertauscht sein.</li>
  </ul>
</div>