<div class="mume markdown-preview  ">



    <h1 class="mume-header" id="wichtige-verbesserungenhinweise">3.1.0 Wichtige Verbesserungen/Hinweise (13.1.2022)</h1>

    <div class="row-section">
        <div class="col">
            <p>Wenn sich deine Foundry v9 Installation etwas merkwürdig verhält, lohnt sich vielleicht das hier:</p>
        </div>
    </div>
    <div class="row-section">
        <div class="col">
            <img src="systems/dsa5/lazy/patchimages/3.1.0/cache.webp" />
        </div>
    </div>

    <h2 class="mume-header" id="spieler-men%C3%BC">Spieler-Men&#xFC;</h2>
    <div class="row-section">
        <div class="col sixty">
            <p>Neben dem Spielleitermen&#xFC; gibt es jetzt ein Spielermen&#xFC;. Wie der Name schon sagt, ist es in erster Linie f&#xFC;r Spieler gedacht, um bei bestimmten komplizierten Vorg&#xE4;ngen zu helfen. Als erstes wird die Beschw&#xF6;rung von
                Kreaturen verf&#xFC;gbar sein (siehe unten). Zuk&#xFC;nftige Updates k&#xF6;nnten Werkzeuge und Regeln zur Herstellung von Gegenst&#xE4;nden, Alchemie und andere baukasten&#xE4;hnliche Aufgaben beinhalten.
            </p>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/3.1.0/playermenu.webp" />
        </div>
    </div>
    <h2 class="mume-header" id="beschw%C3%B6rung">Beschw&#xF6;rung</h2>
    <div class="row-section">
        <div class="col sixty">
            <p>Das Spielermen&#xFC; enth&#xE4;lt nun die M&#xF6;glichkeit, Kreaturen zu beschw&#xF6;ren. Das Basissystem enth&#xE4;lt Regeln f&#xFC;r Elementare und D&#xE4;monen. Andere Kreaturenkategorien werden sp&#xE4;ter &#xFC;ber verschiedene Module
                hinzugef&#xFC;gt. Mit diesem Werkzeug k&#xF6;nnen die Spieler schnell Beschw&#xF6;rungen mit Hilfe eines Baukastens zusammenstellen, der die entsprechenden Regeln beachtet und m&#xF6;gliche Modifikationen aufzeigt. Nach Fertigstellung
                des Bauplans k&#xF6;nnen die Spieler diesen an den Spielleiter schicken, der dann entscheiden kann, ob er die Kreatur als Token auf den Spielplan setzt. Dazu ben&#xF6;tigt der Spieler mindestens die Beobachtererlaubnis f&#xFC;r die beschworene
                Kreatur, zieht sie auf das Beschw&#xF6;rertool und w&#xFC;rfelt dann den Beschw&#xF6;rungszauber, der automatisch um den Beschw&#xF6;rungsmodifikator der Kreatur modifiziert wird. Die App zeigt die verf&#xFC;gbaren Qualit&#xE4;tsstufen
                an, die dann f&#xFC;r zus&#xE4;tzliche Dienste verwendet oder ausgeben werden k&#xF6;nnen, um der Kreatur Modifikatoren und Eigenschaften hinzuzuf&#xFC;gen.</p>

        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/3.1.0/summoning.webp" />
        </div>
    </div>
    <h2 class="mume-header" id="verbesserung-des-lichtmakros">Verbesserung des Lichtmakros</h2>
    <div class="row-section">
        <div class="col sixty">
            <p>Das im Grundregelwerk enthaltene Lichtmakro wurde komplett &#xFC;berarbeitet. Zu den neuen Funktionen geh&#xF6;ren unter anderem folgende:</p>
            <ul class="dsalist">
                <li>Lichteinstellungen k&#xF6;nnen aktiviert und am Token-HUD angezeigt werden. Nach dem Aktivieren der Einstellung findet sich ein Untermen&#xFC; am Token, um alle Lichter direkt zu aktivieren.</li>
                <li>Die Voreinstellungen f&#xFC;r Licht und Sicht k&#xF6;nnen nun ge&#xE4;ndert werden.</li>
                <li>Licht- und Sichtvoreinstellungen k&#xF6;nnen mit mehreren automatischen Faktoren modifiziert werden, um verschiedene Spielstile zu unterst&#xFC;tzen. Man kann einen allgemeinen Faktor f&#xFC;r jede Licht- und Sicht-Einstellung durch das
                    Makro anwenden lassen. Einen, der jeder Szene unterschiedlich zugeordnet ist. Und schlie&#xDF;lich einen, der den Sichtbereich in Abh&#xE4;ngigkeit von der Dunkelheitseinstellung der Szene neu errechnet. Das bedeutet, dass die Spieler
                    weniger sehen k&#xF6;nnen, je dunkler es wird. Bitte beachten, dass die Faktoren auch zu den Token-HUD-Lichteinstellungen hinzugef&#xFC;gt werden.</li>
                <li>Dar&#xFC;ber hinaus gibt es einen neuen &quot;Auto&quot;-Sichtmodus, der erkennt, ob der Token &#xFC;ber Dunkelheit und &#xE4;hnliche sichtvermindernde Modifikatoren verf&#xFC;gt, und der dann automatisch eine bestm&#xF6;gliche Sch&#xE4;tzung
                    f&#xFC;r die aktiven Sichteinstellungen vornimmt.</li>
                <li>Schlie&#xDF;lich kann man auch die Sichteinstellungen insgesamt automatisieren, so dass sie jedes Mal aktualisiert wird, wenn eine neue Szenen betreten oder die Dunkelheitseinstellung ge&#xE4;ndert wird. Obwohl dies eine n&#xFC;tzliche
                    und starke neue Funktion ist, wird sie h&#xF6;chstwahrscheinlich in zuk&#xFC;nftigen Patches noch etwas Feinabstimmung erfordern.</li>
            </ul>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/3.1.0/lightmacro.webp" />
        </div>
    </div>
    <h1 class="mume-header" id="erweiterungen">Erweiterungen</h1>

    <ul class="dsalist">
        <li>Regeneration (oder Degeneration) von AE, KP und LP am Ende der Runde ist nun m&#xF6;glich (z.B. bei Vampiren)
        </li>
        <li>Akteure k&#xF6;nnen nun Effekte zur Erh&#xF6;hung des permanenten Zauberschadens haben</li>
        <li>Kategorie &quot;Magisches Zeichen&quot; ist jetzt verf&#xFC;gbar</li>
        <li>Kategorie &quot;Paktgeschenke&quot; ist jetzt verf&#xFC;gbar</li>
        <li>Der -2 Modifikator f&#xFC;r Fremdzauber kann nun &#xFC;ber die Konfiguration aktiviert werden. Es wird ein Modifikator vorgeschlagen und eine Warnung ausgegeben, dass Zaubermodifikationen nicht erlaubt sind. Man kann immer noch beide Vorschl&#xE4;ge
            au&#xDF;er Kraft setzen, wenn man das m&#xF6;chte. Die Entscheidung, ob der Zauberspruch in die Tradition aufgenommen wird, wird durch einen Vergleich zwischen dem Traditionsfeld des Akteursbogens und dem Verteilungsfeld des Zauberspruchs
            getroffen. Stelle also sicher, dass die notwendigen Traditionen dort eingef&#xFC;gt sind!</li>
        <li>Die Berechnung des Schadens, der durch die Bruchfaktorprobe verursacht wird, wurde ein wenig ge&#xE4;ndert. Der Schaden wird nun aufgerundet, wenn die Strukturpunkte nicht durch vier teilbar sind. So war der Schaden an einem Schild mit 30 Strukturpunkten
            vor dem Patch 30/4 abgerundet = 7. Nach dem Patch sind es 30/4 aufgerundet = 8.</li>
        <li>Das Bezahlen und Einfordern von Geld &#xFC;ber das Spielleitermen&#xFC; zieht nun das Geld sofort ab oder zahlt es aus, ohne dass ein Knopfdruck im Chat n&#xF6;tig ist. Dies erm&#xF6;glicht es, Geld an Akteure zu &#xFC;berweisen, die nicht prim&#xE4;r
            mit einem Spieler verbunden sind. Die Chat-Makros /pay und /getPaid funktionieren weiterhin auf die alte Weise.</li>
        <li>Schauspieler-Links in Journalen sollten nun bereits importierte Schauspieler &#xF6;ffnen, wenn sie sich in den automatisch generierten Ordnern befinden. Wenn sie dort nicht verf&#xFC;gbar sind, wird stattdessen der Kompendiumeintrag ge&#xF6;ffnet.</li>
        <li>Munition &#xFC;bertr&#xE4;gt ihre Dom&#xE4;nenattribute (z.B. magisch, gesegnet) w&#xE4;hrend eines Schusses auf die Fernkampfwaffe, wodurch der Angriff magisch oder gesegnet wird.</li>
        <li>Das System kann nun Rollsmiths&apos; W&#xFC;rfel verwenden, also benutzerdefinierte W&#xFC;rfelsysteme. Du kannst ein System f&#xFC;r jeden W&#xFC;rfeltyp einstellen (z.B. f&#xFC;r Mut, Angriff). Siehe Konfiguration von DSA.</li>
    </ul>
    <h1 class="mume-header" id="fehlerbehebungen">Fehlerbehebungen</h1>

    <ul class="dsalist">
        <li>Mehrere Kompatibilit&#xE4;tsanpassungen an TDE-Modulen f&#xFC;r Foundry 9</li>
        <li>Die korrekte Patzertabelle f&#xFC;r Liturgien sollte angezeigt werden.</li>
        <li>Profession/Spezies/Kultur Wizards f&#xFC;gen F&#xE4;higkeiten, die von anderen F&#xE4;higkeiten abh&#xE4;ngen, etwas besser hinzu</li>
        <li>Hotkey f&#xFC;r n&#xE4;chsten Zug kann von Spielern nicht mehr benutzt werden, wenn sie nicht am Zug sind
        </li>
        <li>Vorteil &quot;Z&#xE4;hes Tier&quot; berechnet die Schmerzresistenz richtig</li>
        <li>Kompatibilit&#xE4;t zum Modul &quot;Multilevel-Tokens&quot; verbessert</li>
        <li>Kompatibilit&#xE4;t zum Modul &quot;Monarch&quot;</li>
    </ul>

</div>