<div class="mume markdown-preview  ">

    <h1 class="mume-header" id="wichtige-neue-features">2.2.0 Wichtige neue Features (30.7.2021)</h1>
    <div class="row-section">
        <div class="col sixty">
            <h2 class="mume-header" id="verbesserung-der-suchfilter-in-der-bibliothek">Verbesserung der Suchfilter in der Bibliothek
            </h2>

            <p>Die Bibliothek hat neue, erweiterte Filterm&#xF6;glichkeiten. Du kannst diese durch einen Klick auf das Gehirn Icon neben dem Suchfeld aktivieren. Neben vielen weiteren Optionen kannst du z.B. nach Kreaturen &#xFC;ber deren Typ oder Sonderfertigkeiten
                &#xFC;ber deren Subkategorie suchen.<br> Obwohl das eine riesige Verbesserung f&#xFC;r die N&#xFC;tzlichkeit der Bibliothek ist, ist dies immer noch ein Zwischenstand. Die Arbeitsspeicherauslastung ist immer noch etwas zu hoch und muss
                weiter verbessert werden. Die Seitennummerierung ist auch noch nicht perfekt.<br> ACHTUNG: Firefox scheint Memory Leaks zu erzeugen, wenn man die Bibliothek indexiert und zu oft den Tab aktualisiert. Wenn du Firefox benutzt, hilft es vlt.
                ab und zu den Tab zu schlie&#xDF;en und neu zu &#xF6;ffnen. Chromium basierte Browser zeigen hier kein Problem.</p>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/2.2.0/library.webp">
        </div>
    </div>
    <div class="row-section">
        <div class="col sixty">
            <h2 class="mume-header" id="journalbrowser-verbesserungen">Journalbrowser Verbesserungen</h2>

            <p>Der Journalbrowser erlaubt es nun nach Kapiteltiteln zu suchen. Man kann au&#xDF;erdem die Journal Inhalte durchsuchen durch aktivieren der Volltextsuche &#xFC;ber den Button neben dem Suchfeld.<br> Au&#xDF;erdem kann der Journalbrowser nun
                Journaleintr&#xE4;ge anpinnen. Das hilft enorm dabei, wenn du st&#xE4;ndig diese eine Regel vergisst und sie immer wieder suchen musst. Oder auch wenn du die information von mehreren Seiten gleichzeitig ben&#xF6;tigst (z.b. aktuelle Szene
                + lokale Ger&#xFC;chte).<br> Um einen Journal Eintrag anzupinnen, &#xF6;ffne ihn im Browser und klicke den &quot;Anpinnen&quot; Button oder ziehe per Drag and Drop einen Journaleintrag auf den Journalbrowser. Man kann Eintrge von jeder
                Quelle anpinnen. Um den Pin wieder zu entfernen, klicke mit der rechten Maustaste auf den jeweiligen Button.<br> Die angehefteten Nachrichten sind unterschiedlich f&#xFC;r jeden Spieler/SL. Dadurch k&#xF6;nnen auch Spieler dieses Feature
                benutzen, um z.B. wichtige Handouts oder Notizen griffbereit zu haben.</p>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/2.2.0/journalbrowser.webp">
        </div>
    </div>
    <h1 class="mume-header" id="verbesserungen">Verbesserungen</h1>

    <ul>
        <li>
            <p>Das Verhalten der Ausr&#xFC;stungs-Unterkategorie Dienstleistung hat sich f&#xFC;r H&#xE4;ndler ge&#xE4;ndert. Wenn man nun eine Dienstleistung von einem H&#xE4;ndler kauft, bekommt man nicht mehr den Gegenstand ins Inventar &#xFC;bertragen.
                Stattdessen erscheint im Chat eine Nachricht &#xFC;ber den abgeschlossenen Kauf. Das erm&#xF6;glicht das Erstellen eines Pferdeh&#xE4;ndlers oder Pet Shop Boys mit dem bald verf&#xFC;gbaren Tiergef&#xE4;hrten Modul.</p>
        </li>
        <li>
            <p>Die Eigenschaft &quot;Vertrauter&quot; funktioniert nun &#xFC;ber Active Effects.</p>
        </li>
        <li>
            <p>Den &quot;Ausr&#xFC;sten&quot; Button im Inventar anzuklicken l&#xF6;st nun einen kleinen Ton aus, sofern die Game Audio Bundles installiert sind.</p>
        </li>
        <li>
            <p>Das gegenw&#xE4;rtige Ziel wird nun im Angriffsprobenfenster angezeigt.</p>
        </li>
        <li>
            <p>Das Bezahlen oder Verkaufen von Dingen an H&#xE4;ndlern sollte nun einen kleinen Ton abspielen, sofern die Game Audio Bundles installiert sind.</p>
        </li>
        <li>
            <p>Der /pay und /getpaid Button sollte nun einen kleinen Ton abspielen, sofern die Game Audio Bundles installiert sind.</p>
        </li>
        <li>
            <p>Der &quot;Zuf&#xE4;lliges Opfer&quot; Button im Spielleitermen&#xFC; kann nun Ungl&#xFC;ck in den Wurf miteinberechnen (Rechtsklick) und den Wurf auch nur auf einen Teil der Spieler ausf&#xFC;hren.</p>
        </li>
        <li>
            <p>Ein Klick auf die transferierten Statuseffekte auf dem Charakterblatt sollte nun die Quelle des Effekts &#xF6;ffnen.
            </p>
        </li>
        <li>
            <p>Es gibt nun eine Einstellung, um die Liste der Modifikatoren bei Proben immer ausgeklappt anzuzeigen im Chat.
            </p>
        </li>
        <li>
            <p>Die Spalte f&#xFC;r die Belastung im Talente Abschnitt auf dem Charakterbogen wurde zu Gunsten von Automatisierung und einem saubereren Layout entfernt.</p>
        </li>
        <li>
            <p>Es gibt im Probenfenster f&#xFC;r Spielleiter nun die M&#xF6;glichkeit ein erw&#xFC;nschtes W&#xFC;rfelergebnis einzugeben. Diese unversch&#xE4;mten Spieler haben es wirklich verdient mal verpr&#xFC;gelt zu werden! (Bitte niemand erz&#xE4;hlen,
                dass man so auch unauff&#xE4;llig Charaktere retten kann)
            </p>
        </li>
        <li>
            <p>Eine Eigenschaft die &quot;Begleiter/Companion&quot; benannt wird, erm&#xF6;glicht es jetzt die Abenteuerpunkte- und Tragelastberechnung f&#xFC;r Kreaturen zu aktivieren (in etwa wie die Eigenschaft &quot;Vertrauter&quot;).
            </p>
        </li>
        <li>
            <p>Ein paar ausklappbare Listen sollten nun etwas hilfreicher sortiert sein.</p>
        </li>
        <li>
            <p>Der /ch Befehl kann nun auch als Macro benutzt werden. Versuche &quot;game.dsa5.macro.rollCh()&quot; f&#xFC;r einen einfachen 3W20 Wurf und &quot;game.dsa5.macro.rollCh(&quot;Fliegen&quot;, {modifier: 1})&quot; um den Wurf mit dem entsprechenden
                Talent zu konfigurieren.</p>
        </li>
        <li>
            <p>Der /ch Befehl ist nun auch f&#xFC;r Journals verf&#xFC;gbar. Schau dir @Gc und @Rq f&#xFC;r Beispiele und Formatierung an.</p>
        </li>
        <li>
            <p>Gegenst&#xE4;nde die verzaubert wurden oder Effekte haben werden nun mit einem visuellen Hinweis dargestellt.
            </p>
        </li>
    </ul>
    <h1 class="mume-header" id="bugfixes">Bugfixes</h1>

    <ul>
        <li>Der versteckte Gruppenwurf im Spielleitermen&#xFC; sollte nicht mehr situationsbedingte Modifikatoren beim falschen Spieler anwenden.</li>
        <li>Der Erholungswurf sollte die Modifikatoren wieder richtig anzeigen.</li>
        <li>Gifteffekte sollten wieder ausw&#xFC;rfelbar sein.</li>
        <li>AsP und KaP k&#xF6;nnen nun auch regeneriert werden, wenn der LeP Wurf 0 oder kleiner war.</li>
    </ul>

</div>