<h1 class="mume-header" id="wesentliche-verbesserungen">Wesentliche Verbesserungen  (15.9.2023)</h1>

<h2 class="mume-header" id="gro%C3%9Fe-aktualisierung-der-basissdaten---codizes">Gro&#xDF;e Aktualisierung der Basissdaten - Codizes</h2>

<p>In dieser Iteration lag unser Hauptaugenmerk auf der Verbesserung unserer bestehenden Daten. Dazu haben wir eine erhebliche Anzahl neuer Tests implementiert, um die Genauigkeit und G&#xFC;ltigkeit der Daten sicherzustellen. Die resultierenden &#xC4;nderungen sind wie folgt:</p>
<ul class="dsalist">
<li>Wir haben die Berechnung der Professionskosten an die Methode angepasst, die auch von DSA5 in Foundry verwendet wird. Dadurch besteht eine direkte &#xDC;bereinstimmung zwischen Abenteuerpunkten und den zugeh&#xF6;rigen Professionselementen. Diese Korrektur behebt Ungenauigkeiten, die im Quellmaterial vorhanden waren. Dar&#xFC;ber hinaus wurden Anpassungen vorgenommen, um &#xC4;nderungen von DSA5 in der Foundry zu ber&#xFC;cksichtigen, um eine reibungslose Funktionsweise der Berufe sicherzustellen (z. B. Ausschluss zus&#xE4;tzlicher AP f&#xFC;r Fl&#xFC;che von Hexen). Dar&#xFC;ber hinaus spiegeln Updates von Professionskomponenten, wie &#xC4;nderungen der AP-Kosten f&#xFC;r Sonderfertigkeitenn, jetzt sofort eine verf&#xFC;gbare und aktualisierte Summe der AP-Kosten f&#xFC;r den gesamten Beruf wider.</li>
<li>Zahlreiche kleinere Probleme in allen Kategorien wurden sorgf&#xE4;ltig behoben.</li>
<li>Die &#xC4;nderungen aus &quot;Kodex der Magie&quot; und &quot;Kodex der Helden&quot; wurden &#xFC;berall dort integriert, wo es m&#xF6;glich war, Vorteile, Nachteile und Sonderfertigkeitenn betreffend.</li>
<li>Modifikationen aus dem &quot;Kodex des Schwertes&quot; wurden in bestehende Sonderfertigkeitenn integriert, w&#xE4;hrend neue in das &quot;Aventurische Kompendium II&quot; aufgenommen wurden.</li>
<li>Der Charaktergenerator wurde f&#xFC;r eine verbesserte Funktionalit&#xE4;t optimiert.</li>
<li>Eine Vielzahl zus&#xE4;tzlicher F&#xE4;higkeiten wurde erfolgreich implementiert, um den Funktionsumfang zu erweitern.</li>
<li>Zus&#xE4;tzliche magische Sonderf&#xE4;higkeiten wurden nahtlos in die &quot;Studierstube der Gildenmagie&quot; aufgenommen.</li>
<li>Neue Vor- und Nachteile im Zusammenhang mit Namenskonventionen wurden der Meisterwerkstatt hinzugef&#xFC;gt.</li>
</ul>
<p><b>Bis alle Module aktualisiert sind, kann das ein paar Tage dauern (prüfe ob das Modul bereits die Version 5.1.0 oder höher hat, wenn du nach einem bestimmten Feature suchst).</b></p>
<h2 class="mume-header" id="automatisierung-der-compendium-2-tabellen">Automatisierung der Compendium 2-Tabellen</h2>

<p>Die zuvor manuell verwalteten Kritischen- und Patzer-Tabellen f&#xFC;r den Kampf im Aventurischen Kompendium 2-Modul wurden weitestgehend automatisiert. Nach einer ausgedehnten Entwicklungszeit haben wir einen fortgeschrittenen Automatisierungsgrad erreicht. Obwohl es eine Herausforderung ist, alle m&#xF6;glichen Patzerw&#xFC;rfe abzudecken, haben wir erhebliche Fortschritte erzielt und bieten die Funktion nun in ihrem aktuellen Stand an. Diese automatisierten Tabellen behandeln verschiedene Bedingungen und Modifikatoren im Zusammenhang mit Kritik- und Patzerw&#xFC;rfen.</p>
<h2 class="mume-header" id="%C3%BCberarbeitung-von-suncoast-und-zukunft-der-regional-erg%C3%A4nzungen">&#xDC;berarbeitung von Suncoast und Zukunft der Regional-Erg&#xE4;nzungen</h2>

<p>Wir haben Regional-Erg&#xE4;nzungen innerhalb des Foundry-Moduls neu konzipiert und eine verbesserte Version des bestehenden Suncoast-Inhalts geschaffen. Unsere &#xFC;berarbeitete Herangehensweise wird f&#xFC;r alle zuk&#xFC;nftigen Erg&#xE4;nzungen standardisiert sein. Zus&#xE4;tzlich planen wir, diese Erg&#xE4;nzungen in einer Art Atlas-Format (~Foundry 12) zu kombinieren, mit zus&#xE4;tzlichen Funktionen, wo immer dies m&#xF6;glich ist. Diese Funktionen umfassen automatisch generierte H&#xE4;ndler, die abh&#xE4;ngig vom Ort variieren, Visualisierung von g&#xE4;ngigen Reiserouten als Karten&#xFC;berlagerungen, detaillierte Angaben wie regionale Begegnungen, Kartenhinweise sowie Umgebungslichteffekte f&#xFC;r n&#xE4;chtliche Stadtszenarien. F&#xFC;r aktuelle Suncoast-Benutzer empfehlen wir, importierte Ordner zu entfernen und das Modul &#xFC;ber den Journal-Browser neu zu initialisieren. Schaut euch auch die den Sphärenklang-Soundtrack an, der nun in allen Regionalspielhilfen vorhanden ist.</p>
<img src="systems/dsa5/lazy/patchimages/5.1.0/rshs.webp" />
<h2 class="mume-header" id="integration-von-schwarmregeln">Integration von Schwarmregeln</h2>

<p>Ein neuer Abschnitt zur Schwarmkonfiguration wurde in den Kampf-Tabellen der Heldenbogen integriert. Benutzer k&#xF6;nnen nun die Gr&#xF6;&#xDF;e des Schwarms und die Basisgr&#xF6;&#xDF;e konfigurieren, was zu angepassten Kampfmodifikatoren und Lebenspunkten f&#xFC;hrt. Dieses System deckt die Grundregeln f&#xFC;r kleine und winzige Kreaturen ab und er&#xF6;ffnet M&#xF6;glichkeiten f&#xFC;r taktische Auseinandersetzungen mit Einheiten und Soldaten in gr&#xF6;&#xDF;eren Schlachten, wie etwa dem Rabenkrieg.</p>
<img src="systems/dsa5/lazy/patchimages/5.1.0/swarm.webp" />
<h2 class="mume-header" id="erweiterte-automatisierungsabdeckung">Erweiterte Automatisierungsabdeckung</h2>

<p>Wir freuen uns, eine neue Erweiterung des GitHub-Repositorys &quot;extensiondb&quot; bekannt zu geben, die sich auf die Abdeckung automatisierter Funktionalit&#xE4;ten in verschiedenen Kategorien konzentriert. Eine umfassende &#xDC;bersicht &#xFC;ber automatisierte F&#xE4;higkeiten findet sich hier: <a href="https://github.com/Plushtoast/dsa5-extensiondb/blob/master/summary.md">GitHub Link</a>. Detaillierte Informationen sind hier zu finden: <a href="https://github.com/Plushtoast/dsa5-extensiondb/blob/master/README.md">GitHub README</a>. Wir arbeiten aktiv daran, M&#xF6;glichkeiten zu schaffen, damit Freiwillige in Zukunft mehr Inhalt beitragen k&#xF6;nnen. Unser Zielwert f&#xFC;r neu ver&#xF6;ffentlichte Module betr&#xE4;gt ungef&#xE4;hr 60% Abdeckung, kann jedoch je nach spezifischem Modul variieren.</p>
<h2 class="mume-header" id="einf%C3%BChrung-von-widrigen-umst%C3%A4nden">Einf&#xFC;hrung von Widrigen Umst&#xE4;nden</h2>

<p>Eine neue Funktion, die in die Master-Toolbar des Kernmoduls integriert wurde, ist &quot;Widrige Umst&#xE4;nde&quot;. Diese Funktion soll mit Reisen und langanhaltenden Herausforderungen wie der Verwaltung von Nahrung und Problemen aus der Umgebung wie extremer Hitze oder K&#xE4;lte umgehen. Die Funktionen umfassen:</p>
<ul class="dsalist">
<li>Proviantverbrauch verwalten.</li>
<li>Berechnung und Anwendung von Hitze- und K&#xE4;ltegraden sowie zugeh&#xF6;rigen einzigartigen Zust&#xE4;nden.</li>
<li>Zuk&#xFC;nftige Updates k&#xF6;nnen zus&#xE4;tzliche Funktionen einf&#xFC;hren, um das Gameplay in widrigen Szenarien zu verbessern.</li>
</ul>
<img src="systems/dsa5/lazy/patchimages/5.1.0/widrige.webp" />
<h1 class="mume-header" id="bemerkenswerte-verbesserungen">Bemerkenswerte Verbesserungen</h1>

<ul class="dsalist">
<li>Unser Dank gilt Zoidable, der die komplexe Spezialf&#xE4;higkeit &quot;Gegenhalten&quot; erfolgreich implementiert hat.</li>
<li>Zuk&#xFC;nftige Updates f&#xFC;r Kompendien werden nun geordnete Journale und Aktoren in Ordnern f&#xFC;r verbesserte Zug&#xE4;nglichkeit enthalten.</li>
<li>Der Browser-Modus der Bibliothek zeigt jetzt Indikatoren f&#xFC;r das Quell-Kompendium/Modul f&#xFC;r Gegenst&#xE4;nde an.</li>
<li>Die Verwendung von &quot;prosemirror&quot; f&#xFC;r Informationsgegenst&#xE4;nde erm&#xF6;glicht das Hinzuf&#xFC;gen von Links zu Gegenst&#xE4;nden, Aktoren und anderen Elementen in den Ergebnissen der Qualit&#xE4;tsstufe.</li>
<li>Der automatisierte Sichtmodifikator kann jetzt mit Schl&#xFC;sseln aktiver Effekte ge&#xE4;ndert werden. Bestehende F&#xE4;higkeiten wie &quot;Blinder Kampf&quot; oder &quot;Nachtblindheit&quot; wurden entsprechend angepasst. Stellen Sie sicher, dass Sie Ihre Charaktere entsprechend migrieren und Zoidable f&#xFC;r seinen Beitrag anerkennen.</li>
<li>Das Sichtautomatisierungssystem unterscheidet nun zwischen ged&#xE4;mpftem und hellem Licht und f&#xFC;hrt zu entsprechenden Sichtbarkeitsanpassungen. Diese Funktion kann &#xFC;ber das Master-Men&#xFC; aktiviert werden. Zum Beispiel kann ein Charakter, der in v&#xF6;lliger Dunkelheit mit einem Elfenbogen zielen m&#xF6;chte, warten, bis das Ziel ins helle Licht einer Fackel gelangt, um die Sichtbeeintr&#xE4;chtigung zu verringern und die Genauigkeit zu verbessern.</li>
<li>Der Bibliotheksfilter f&#xFC;r Detailinformationen (Gehirn) unterst&#xFC;tzt jetzt die Suche nach Verteilungen von Sonderfertigkeiten, wie z.B. Paktgaben.</li>
<li>Benachrichtigungen wurden f&#xFC;r Gift-, Krankheits- und Zauberw&#xFC;rfe implementiert, wenn das Ziel gegen den Effekt immun ist (z.B. D&#xE4;monen sind immun gegen Gift). Eine genaue Zielauswahl vor dem Wurf ist ratsam.</li>
<li>Eine Warnmeldung wird angezeigt, wenn versucht wird, einer Kreatur einen Zustand hinzuzuf&#xFC;gen, die normalerweise gegen den Effekt immun sein sollte (z.B. k&#xF6;nnen D&#xE4;monen nicht bet&#xE4;ubt werden).</li>
<li>Das Design der Initiative-Wurf-Chatnachricht wurde aktualisiert.</li>
<li>K&#xE4;lte- und Hitzewiderst&#xE4;nde werden jetzt auf dem Charakterbogen angezeigt und bieten umfassende Einblicke in die F&#xE4;higkeiten des Charakters.</li>
<li>Pers&#xF6;nlichkeitseigenschaften und Einfl&#xFC;sse wurden als Kategorien von Gegenst&#xE4;nden eingef&#xFC;hrt, wobei Pl&#xE4;ne zur Aufnahme von entsprechenden Elementen aus den Regelb&#xFC;chern in die Kompendien in der Zukunft bestehen.</li>
<li>Chatnachrichten mit Schadens- oder normalen W&#xFC;rfen erlauben jetzt Rechtsklickaktionen, um doppelten oder halben Schaden anzuwenden, wobei die Option in den Einstellungen verf&#xFC;gbar ist.</li>
<li>Die Bibliothek verf&#xFC;gt nun &#xFC;ber einen Mechanismus zur Erkennung von Duplikaten zur besseren Organisation des Inhalts.</li>
<li>Beim Hovern &#xFC;ber Token werden jetzt Icons angezeigt, die die ausger&#xFC;steten Waffen anzeigen, sodass Spieler die Bewaffnung der Feinde bei ihren Strategien ber&#xFC;cksichtigen k&#xF6;nnen.</li>
<li>NPCs mit mehreren ausger&#xFC;steten Waffen w&#xE4;hlen nun zuf&#xE4;llig eine davon aus, wenn sie auf die Leinwand platziert werden. Dies optimiert automatisierte Modifikatoren im Zusammenhang mit Waffenl&#xE4;nge und Kampf. Die Option, dieses Verhalten zu deaktivieren, ist in den Einstellungen verf&#xFC;gbar.</li>
<li>Die &quot;Move-to-Pin&quot;-Funktion des Journals kann nun auch auf Journalseiten angewendet werden.</li>
<li>Der Lichtassistent verf&#xFC;gt nun &#xFC;ber eine Schaltfl&#xE4;che f&#xFC;r empfohlene Standardwerte.</li>
<li>Weitere Erkennungsmuster f&#xFC;r das Modul &quot;Automated Animations&quot; wurden implementiert, die die Definition von Ausl&#xF6;sern f&#xFC;r verschiedene Kampfanimationen erm&#xF6;glichen.</li>
</ul>
<pre data-role="codeBlock" data-info class="language-"><code>Dolch
Dolch (Parade)
Dolch (Kritischer Erfolg)
Dolch (Patzer)
Kritischer Erfolg
Patzer
Parade
Parade (Kritischer Erfolg)
Parade (Patzer)
</code></pre><ul>
<li>Traditionelle Artefaktf&#xE4;higkeiten k&#xF6;nnen nun auch aktiviert werden, wenn keine Makros angeh&#xE4;ngt sind, was die Zahlung von AsP-Kosten beinhaltet.</li>
<li>Beschw&#xF6;rungsf&#xE4;higkeiten k&#xF6;nnen nun auch &quot;m&#xE4;chtige Kreatur&quot; oder andere F&#xE4;higkeiten von Kreaturen verwenden, die mehrfach ausgew&#xE4;hlt werden k&#xF6;nnen.</li>
<li>Dauerhafte gezahlte AsP/KaP-Punkte k&#xF6;nnen nun &#xFC;ber den Charakterbogen verfolgt werden, wobei spezielle F&#xE4;higkeiten automatisch entsprechende p-Kosten anwenden. Bei der Migration sollte darauf geachtet werden, die Neukaufwerte f&#xFC;r Ihren Charakter zu &#xFC;berpr&#xFC;fen, um die AE/KE-Punkte genau zu erfassen.</li>
</ul>
<h1 class="mume-header" id="fehlerbehebungen">Fehlerbehebungen</h1>

<ul class="dsalist">
<li>Der Status-Texteffektwurf enth&#xFC;llt nun nicht mehr unbeabsichtigt Zust&#xE4;nde, die Schauspielern hinzugef&#xFC;gt wurden, die von Spielern nicht besessen werden, insbesondere wenn die Option &quot;Effekte verbergen&quot; aktiviert ist.</li>
<li>Die automatische Token-Nummerierung ber&#xFC;cksichtigt nun gel&#xF6;schte Token.</li>
<li>Ein Fehler wurde behoben, der verhinderte, dass Reaktionsw&#xFC;rfe im Kampf ordnungsgem&#xE4;&#xDF; funktionierten.</li>
<li>Die &quot;blind&quot;-Funktion im Lichtassistenten funktioniert nun wie beabsichtigt.</li>
<li>Die Positionierung der Angriffsschaltfl&#xE4;che im Kampf-Tracker stimmt nun genau mit dem aktiven Schauspieler &#xFC;berein, selbst wenn die Liste der Kampfteilnehmer die Abmessungen der Anzeige &#xFC;bersteigt.</li>
<li>Der Besch&#xF6;rungsassistent im Spieler-Men&#xFC;, der von der v10-Foundry-Aktualisierung beeinflusst wurde, wurde erfolgreich wiederhergestellt und funktioniert nun ordnungsgem&#xE4;&#xDF;.</li>
</ul>