<div class="mume markdown-preview  ">

    <h1 class="mume-header" id="important-enhancementsnotes">3.5.0 Wichtige Verbesserungen/Notizen (11.7.2022)</h1>

    <h1 class="mume-header" id="enhancemnets">Verbesserungen</h1>
    <ul class="dsalist">
        <li>Die Darstellung der tempor&#xE4;reren Regeneration wurde ein bisschen ge&#xE4;ndert</li>
        <li>Belastung beeinflusst nicht mehr den Fernkampf (dies kann aber als Hausregel wieder als Systemeinstellung
            aktiviert werden)</li>
        <li>Gruppensammelproben k&#xF6;nnen nun auch unterschiedliche Talente umfassen</li>
        <li>Die Sprache kann nun f&#xFC;r alle Clients &quot;erzwungen&quot; werden. Spieler deren Sprache sich von der
            Sprache der Welt unterscheidet erhalten eine Warnung. Unterschiedliche Spracheinstellungen k&#xF6;nnen dazu
            f&#xFC;hren, dass einige Funktionen nicht richtig ablaufen.</li>
        <li>Der Button f&#xFC;r die &#xDC;bertragung von Effekten wird nun kurzzeitig gesperrt, um ein
            Mehrfachausl&#xF6;sen zu unterbinden.</li>
        <li>Der Best&#xE4;tigungswurf von 1W20 Proben kann nun auch &#xFC;ber manuelle W&#xFC;rfe oder die
            SL-Willk&#xFC;r modifiziert werden.</li>
        <li>NSCs d&#xFC;rfen nun auch Regeneration w&#xFC;rfeln</li>
        <li>Der DSA Kampftracker fokusiert nun auf den aktuellen Zug (Systemeinstellung, bereits &#xFC;ber fr&#xFC;heren
            Hotfix)</li>
        <li>SL-Willk&#xFC;r oder manuelle W&#xFC;rfe selektieren nun beim ersten Click in das Eingabefeld den kompletten
            Wurf (vorher: +- 1 Funktion wurde ausgel&#xF6;st)</li>
        <li>Die Trefferpunkte von Zaubern k&#xF6;nnen nun auch &#xFC;ber die SL-Willk&#xFC;r und manuelle W&#xFC;rfe
            modifiziert werden.</li>
        <li>Dialoge f&#xFC;r Proben zeigen nun den vorraussichtlichen finalen modifizierten Fertigkeitswert an (bereits
            &#xFC;ber fr&#xFC;heren Hotfix)</li>
        <li>Die Volltextsuche f&#xFC;r die Bibliothek kann nun deaktiviert werden um Ressourcen zu sparen (erfordert
            neuladen)</li>
        <li>Die Lichtvorlagen im Grundregelwerk wurden ein bisschen verbessert</li>
        <li>Der Werkstatt des Meisters hat nun ein Chatcommand f&#xFC;r Zufallsnamen</li>


    </ul>

    <h1 class="mume-header" id="bugfixes">Bugfixes</h1>
    <ul class="dsalist">
        <li>Die r&#xF6;mische Stufe von Sonderfertigkeiten wird nun bis Stufe 10 angezeigt</li>
        <li>Der Kampftracker zeigt nun auch Tokenbilder mit &apos;(&apos; im Namen korrekt an</li>
    </ul>

</div>