<div>
    <h1 class="mume-header" id="nachrichten">Foundry DSA News (10.3.2022)</h1>

    <h2>VTToms Foundry-Channel</h2>
    <div class="row-section">
        <div class="col sixty">
            <p>
                VTTom hat wieder noch mehr nützlicher neuer Tutorials in seinem <a
                    href="https://www.youtube.com/channel/UCgVzSn5NkMaO-PDxhCiAAjA" target="_blank">Channel</a>
                erstellt.
                </br>
            <p>Und wieder ein Changelog video:</p>
            <a href="https://youtu.be/D2vQ5KdWJWM" target="_blank">Changelog</a>
            </p>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/3.5.0/vttom.webp">
        </div>
    </div>
    <h2>Klingen der Nacht</h2>
    <div class="row-section">
        <div class="col sixty">
            <p>Tief unter dem Eis verborgen erhebt sich eine neue Gefahr. Stellen sich deine Helden dieser
                Herausforderung und bannen die Gefahr?
                Mit dem Abenteuer-Modul erhältst du alle nötigen Informationen an die Hand, um Herausforderungen,
                Meisterpersonen und Begegnungen für deine Helden kreativ auszugestalten.
                Du erhältst über 90 Charakter und Kreaturen, 22 Ausrüstungsgegenstände und Nahkampfwaffen sowie Rituale,
                Zauber und Sonderfertigkeiten. Zu dem Modul gehören außerdem über 10 wunderschön illustrierte Karten,
                die exklusiv für das Abenteuer in Foundry VTT angefertigt wurden.</p>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/4.3.0/blades.webp">
        </div>
    </div>
    <h2 class="mume-header" id="-grimorum-cantiones-update">Grimorum Cantiones Update</h2>
    <div class="row-section">
        <div class="col sixty">
            <p>Alle Zauber-, Ritual- und Zaubertrick-&#xC4;nderungen aus dem Buch &quot;Grimorum Cantiones&quot; wurden
                kostenlos in alle bestehenden Module aufgenommen. F&#xFC;r die deutsche Version (keine &#xDC;bersetzung
                verf&#xFC;gbar) bedeutet dies auch zus&#xE4;tzliche Informationen in der Beschreibung wie Gesten und den
                Effekt von &quot;Reversalis&quot;. F&#xFC;r alle Sprachen wurden die Attribute angepasst, so dass die
                Zauberspr&#xFC;che jetzt etwas anders funktionieren k&#xF6;nnen. Stellt sicher, dass ihr eure
                Zauberwirker migriert.<br>
                Zus&#xE4;tzliche Zauberspr&#xFC;che, die nur im Grimorum verf&#xFC;gbar sind, wurden dem Modul
                &quot;Studierstube der Gildenmagie&quot; hinzugef&#xFC;gt. Es wird kein separates Modul
                &quot;Grimorum&quot; geben.<br>
                Deutsche User k&#xF6;nnen sich hier eine kurze Erkl&#xE4;rung geben lassen: <a
                    href="https://www.youtube.com/watch?v=R16x-72cBlc&amp;ab_channel=VTTom">VTToms Youtube-Kanal</a></p>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/4.3.0/cantiones.webp">
        </div>
    </div>

    <h2 class="mume-header" id="-englische-erkl%C3%A4rungsvideos">Englische Erkl&#xE4;rungsvideos</h2>
    <div class="row-section">
        <div class="col sixty">
            <p>Wir versuchen nun, einige englische Videos zu erstellen, die die M&#xF6;glichkeiten des Dark Eye Systems
                erkl&#xE4;ren und wie man diese nutzt.<br>
                Du findest diese hier: <a href="https://www.youtube.com/@letsvtt4914">Lets VTT</a></p>
        </div>
        <div class="col fourty">
            <img src="">
        </div>
    </div>

    <h2 class="mume-header" id="-yendors-ui">Yendor&apos;s UI</h2>
    <div class="row-section">
        <div class="col sixty">
            <p>Yendor mochte die Art und Weise, wie wir die Journale gestylt haben, nicht. Also hat er seinen eigenen
                Stil hier zur Verf&#xFC;gung gestellt: <a
                    href="https://foundryvtt.com/packages/yendors-ui">Yendor&apos;s UI</a><br>
                Vielleicht gef&#xE4;llt euch sein Stil auch.</p>
            <blockquote>
                <p>Das Modul bietet ein alternatives DSA-Design f&#xFC;r Zeitschriften mit neuen M&#xF6;glichkeiten, den
                    Inhalt der Zeitschriften individuell zu gestalten. Dazu geh&#xF6;ren die bekannten &quot;Zum
                    Vorlesen oder Nacherz&#xE4;hlen&quot; oder auch die Segmentboxen aus den DSA5-Publikationen oder
                    auch Bildmasken f&#xFC;r eine sch&#xF6;nere Darstellung von Bildern. Weitere Funktionen sind
                    f&#xFC;r die Zukunft geplant.</p>
            </blockquote>
            <p>(Ich bef&#xFC;rchte, dass die &#xC4;nderungen in TDE 4.3.0 dieses Modul bereits kaputt machen, aber ich
                wette, er wird es bald reparieren).</p>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/4.3.0/yendorsui.webp">
        </div>
    </div>


    <h2>Die Schwarze Katze - Bestiarium</h2>
    <div class="row-section">
        <div class="col sixty">
            <p>
                Die neue Spielhilfe für Foundry VTT vereint das Bestiarium und das Bestiarium - Fasar. Es hält 70 Kreaturen wie z.B. diebische Möwen, Werhunde, Vogelmenschen oder Gelbschwanzskorpion für die erwachten Helden bereit. Neben der vielseitigen Sammlung an großen und kleinen Kreaturen enthält das Modul Regelerweiterungen, Spezialfähigkeiten, Geisterkräfte und vieles mehr.
            </p>
            <p>Erhältlich bald im <a href="https://www.f-shop.de/virtual-tabletops/" target="_blank">F-Shop</a>.</p>
        </div>
        <div class="col fourty">
            <img src="systems/dsa5/lazy/patchimages/4.3.0/dsk.webp">
        </div>
    </div>
</div>