{
    "data": [
        "Du kannst Gegenstände verzaubern, indem du Zauber aus Kompendien auf das Gegenstandsblatt ziehst.",
        "Du kannst Gegenstände in deinem Inventar duplizieren, wenn du STRG hälst und den Gegenstand auf deinem Char Blatt bewegst.",
        "Du kannst die Fähigkeiten und Gegenstände deines Charakters aktualisieren, indem du auf das Kettensymbol auf deinem Charakterblatt klickst.",
        "Du kannst Gegenstände in Taschen ziehen, um dein Inventar sauber zu halten oder die Tasche samt Gewicht schnell abzulegen",
        "Du kannst Schicksalspunkte verwenden, indem du mit der rechten Maustaste auf die Chatnachrichten klickst.",
        "Du kannst Verbrauchsgegenstände benutzen indem du mit der rechten Maustaste im Inventar darauf klickst.",
        "Im Chat /help einzugeben, zeigt dir ein paar nützliche Befehle.",
        "Mit /w im Chat kannst du Spieler anflüstern.",
        "Du kännst Händler- und Schatzcharaktere anlegen, mit denen Spielern direkt Gegenstände tauschen können.",
        "Der Gehirn Button in der Bibliothek stellt ein paar verbesserte Filter zur Verfügung.",
        "Ausrüstung vom Typ Dienstleistung wird bei Händlern nicht ins Spielerinventar übertragen (z.b. der Haarschnitt).",
        "Begleiter und Verbündete lassen sich durch hinzufügen der gleichnamigen Fähigkeit zu Kreaturen erstellen.",
        "Im Spielleitermenü kann man sich ein zufälliges Spieleropfer auswürfeln.",
        "Du kannst temporäre Modifikatoren zur Regeneration im Tab Eigenschaften hinzufügen.",
        "Die Systemeinstellungen erlauben die Verwendung einiger optionaler Regeln.",
        "Du kannst Fähigkeiten deines Charakters in die Hotbar ziehen, indem du auf deinem Charakterblatt den zugehörigen Würfel in die Leiste ziehst.",
        "Einige Module erlauben dem Spielleiter die Gestaltwandlung. Dazu muss die jeweilige Kreatur auf das Charakterblatt gezogen werden.",
        "Du kannst Gifte und Krankheiten auswürfeln, indem du auf dem Gegenstandsblatt das Würfelicon anklickst.",
        "Du kannst Segen und Zaubertricks benutzen indem du den Würfelbutton auf dem Gegenstandsblatt anklickst.",
        "Die Sichtautomatisierung setzt Sichtmodifikatoren für den Kampf (inklusive Dunkelsicht).",
        "Du kannst deine Waffe vergiften, indem du Gift auf das Gegenstandsblatt ziehst. Jedes mal wenn du die Giftprobe durchführst, wird eine Ladung abgezogen.",
        "ALT halten, während du einen Token auf die Map ziehst, platziert diesen unsichtbar.",
        "Rechtsklick auf Grafiken auf den Sheets, in Journals, Bibliothek und Journalbrowser exponiert die Grafik, um sie anschließend den Spielern zu zeigen.",
        "Journals auf den Journalbrowser zu ziehen erzeugt ein Bookmark.",
        "Der Namenlose wird dich heute holen.",
        "Du hast heute ein Vorstellungsgespräch als Futter beim Drachen von nebenan.",
        "Eine Begabung lässt sich durch Rechtsklick auf die passende Chatnachricht verwenden.",
        "Du kannst mit allem parieren...sogar Zaubern (dem System ist das Wurst).",
        "Du kannst einen Vertrauten erstellen, indem du ihm die gleichnamige Eigenschaft gibst (AP/Bonuswerte)",
        "Das Modul \"times-up\" kann Active Effects automatisch nach Ablauf ihrer Wirkungsdauer entfernen.",
        "Es gibt ein DSA Modul um jede Aktion mit einem Interface Ton auszustatten.",
        "Im Kompendium kannst du Regeln für Trefferzonen aktivieren.",
        "Du kannst Zauber per Macro für alle möglichen Effekte automatisieren. Die meisten vorgefertigten Zauber aus den offiziellen Modulen beinhalten solche Makros bereits.",
        "Du musst Tokens ins Ziel nehmen, um von der Automatisierung von Vergleichsproben zu profitieren.",
        "Du solltest Dinge aus Kompendien nur importieren falls es unbedingt erforderlich ist und niemals das komplette Kompendium (keine Bugfixes und Updates, schlechte Performance).",
        "Foundry selbst beinhaltet auch bereits tausende Icons für Ausrüstung.",

        "Im Meistermenü kannst du verschiedene Zufallsgeneratoren finden, wenn du das Modul \"Werkstatt des Meisters\" besitzt.",
        "Du kannst die Bruchfaktorprobe und Waffen- und Rüstungsbeschädigung in den Optionen aktivieren",
        "Modifikatoren auf Grund der Art von Kreaturen werden automatisch hinzugefügt. Du kannst deinen Waffen als Dömane \"geweiht\" oder \"magisch\" hinzufügen, um diese Eigenarten zu überwinden.",
        "Die \"Aventurische Rüstkammer 2\" beinhaltet die Funktionen für Trefferzonenrüstungsschutz.",
        "Du kannst im Meistermenü die Akteure per Drag and Drop sortieren",
        "Du kannst dem Meistermenü neue Helden und Feinde durch Drag and Drop hinzufügen.",
        "In den Optionen lässt sich das automatische Token-beim-Drop-aufs-Canvas-Umbennen aktivieren.",
        "Mit dem Linkbutton neben dem Charakternamen auf dem Charakterblatt kannst du den Charakter auf die Hotbar ziehen,",

        "Das Grundregelwerk Modul kann Sichtbereiche automatisch einstellen.",
        "Die Bibliothek, der Journalbrowser, das Meistermenü und das Angriffsmenü können über ein Taste aktiviert und geschlossen werden.",
        "Im System sind Tokenrahmen für deine eigene Tokens enthalten.",
        "Das Tokenizer Modul wird automatisch konfiguriert, so dass du schnell die DSA Token Rahmen für eigenes verwenden kannst.",

        "Das Spielermenü hilft dir bei Beschwörungen",
        "Im Grundregelwerkmodul findest du nützliche Funktionen für Fackeln und sonstige Lichtquellen.",
        "In den Optionen kannst du den Modifikator für Fremdzauber aktivieren.",
        "Würfelsysteme von \"Rollsmith\" können den DSA Würfeln zugeordnet werden.",

        "Im Ulisses und Foundry Discord wird dir geholfen.",

        "Füge deinem Charakter ein Dämonenmal hinzu, um den Kreis der Verdammnis zu verfolgen.",
        "Du kannst Waffen bauen die gegen bestimmte Kreaturentypen Bonusschaden anrichten",
        "Du kannst magische Rüstungen bauen",
        "Füge einen Patron deinem Charakter hinzu, wenn du einen Geoden spielen möchtest.",
        "Gegenstände und Fähigkeiten können einen Aktivierungseffekt beinhalten.",
        "Der Spielleiter kann Krankheiten dem Charakterbogen hinzufügen.",
        "Active Effects können auch auf ein Zaubermerkmal begrenzt werden",
        "Das Modul \"Automated Animations\" kann deiner Welt Angriffsanimationen hinzufügen.",
        "Zauber und Magische Zeichen können mit Rechtsclick auf die Chatkarte bezahlt werden.",
        "Aktiviere das Dere Positioning System, um Händler nur noch aus der Nähe kontaktieren zu können.",
        "Aktiviere das Dere Positioning System, um den Distanzmodifikator für Fernkampfangriffe automatisch zu setzen.",
        "Das Grundregelwerk enthält Funktionen für die automatische Konfiguration der Sicht.",

        "Update regelmäßig sowohl Foundry, das DSA System und alle Module.",

        "Macht’s gut, und danke für den Fisch.",

        "Die Tokenbar lässt sich verschieben und anpassen.",
        "Du kannst Charaktergrafiken und Bilder in Journals direkt per Drag and Drop auf die Szene ziehen.",
        
        "Du kannst Gegenstände per Drag & Drop auf der Karte ablegen."
    ]
}