{
    "data": [
        "You can enchant items by dragging spells from compendiums to the item sheet.",
        "You can duplicate items in your inventory by dragging and dropping them on your sheet while holding CTRL",
        "You can update your skills and items by clicking the chains symbol on your character sheet.",
        "You can drag items into bags to keep your inventory clean and drop bags quickly reducing your overall weight.",
        "You can use fate points by right clicking on roll messages in the chat.",
        "You can use consumables by right clicking in the inventory on those.",
        "Typing /help in the chat shows some quick commands.",
        "You can whisper to players by typing /w in the chat.",
        "You can create merchant and loot actors, which can exchange items with players directly.",
        "The brain button in the library provides some more advanced filtering options.",
        "Equipment of category service is not transferred to players for merchant sheets (e.g. for hair cuts)",
        "Companions and familiars can be created by adding the corresponding ability to the creature sheet.",
        "The game master's menu can roll a random player victim.",
        "You can add temporary modifiers to regeneration in the tab attributes.",
        "The system settings allow the usage of some optional rules.",
        "You can drop skills to the hotbar, by dragging them from your charactersheet onto the hotbar slots.",
        "Some modules provide the possibility to shapeshift for the GM. Drag and drop the creature onto the target character sheet.",
        "You can roll poisons and diseases by clicking on the dice icon on the item sheet.",
        "You can use blessings and cantrips by clicking the dice button on the item sheet.",
        "The sight automation adjusts vision modifiers in the combat (including dark sight).",
        "You can poison your weapon by dragging poison onto the item sheet. This will deduct one charge of poison each time you roll on it.",
        "Holding ALT while dragging a token onto the map results in placing the token invisibly.",
        "Right clicking on images on sheets, journals, library and journalbrowser opens those in a separate window ready to be shown to players.",
        "Dropping journal entries onto the journal browser bookmarks those.",
        "The Nameless One is going to catch you today.",
        "You've got a job interview today as fodder for the dragon from next door.",
        "Your aptitude can be used via a right click on the corresponding chat message.",
        "You can parry with anything...even spells if you have to (the system doesn't care).",
        "You can create familiars by adding the trait familiar to a creature (AP/Bonus values)",
        "The module \"times-up\" can automatically remove active effects once they expired.",
        "There is a TDE module to attach a sound to every action."
    ]
}