{
    "data": [
        "You can enchant items by dragging spells from compendiums to the item sheet.",
        "You can duplicate items in your inventory by dragging and dropping them on your sheet while holding CTRL",
        "You can update your skills and items by clicking the chains symbol on your character sheet.",
        "You can drag items into bags to keep your inventory clean and drop bags quickly reducing your overall weight.",
        "You can use fate points by right clicking on roll messages in the chat.",
        "You can use consumables by right clicking in the inventory on those.",
        "Typing /help in the chat shows some quick commands.",
        "You can whisper to players by typing /w in the chat.",
        "You can create merchant and loot actors, which can exchange items with players directly.",
        "The brain button in the library provides some more advanced filtering options.",
        "Equipment of category service is not transferred to players for merchant sheets (e.g. for hair cuts)",
        "Companions and familiars can be created by adding the corresponding ability to the creature sheet.",
        "The game master's menu can roll a random player victim.",
        "You can add temporary modifiers to regeneration in the tab attributes.",
        "The system settings allow the usage of some optional rules.",
        "You can drop skills to the hotbar, by dragging them from your charactersheet onto the hotbar slots.",
        "Some modules provide the possibility to shapeshift for the GM. Drag and drop the creature onto the target character sheet.",
        "You can roll poisons and diseases by clicking on the dice icon on the item sheet.",
        "You can use blessings and cantrips by clicking the dice button on the item sheet.",
        "The sight automation adjusts vision modifiers in the combat (including dark sight).",
        "You can poison your weapon by dragging poison onto the item sheet. This will deduct one charge of poison each time you roll on it.",
        "Holding ALT while dragging a token onto the map results in placing the token invisibly.",
        "Right clicking on images on sheets, journals, library and journalbrowser opens those in a separate window ready to be shown to players.",
        "Dropping journal entries onto the journal browser bookmarks those.",
        "The Nameless One is going to catch you today.",
        "You've got a job interview today as fodder for the dragon from next door.",
        "Your aptitude can be used via a right click on the corresponding chat message.",
        "You can parry with anything...even spells if you have to (the system doesn't care).",
        "You can create familiars by adding the trait familiar to a creature (AP/Bonus values)",
        "The module \"times-up\" can automatically remove active effects once they expired.",
        "There is a TDE module to attach a sound to every action.",
        "You can automate spells via macros. Many spells from the official modules already contain those macros.",
        "You need to target tokens to take advantage of the opposed test system e.g. for combats.",
        "You should avoid importing stuff from compendiums at all time and never import the whole compendium if possible (bad performance, no bugfixes and updates).",
        "Foundry itself already includes several thousand icons for gear.",

        "You can find several random generators in the game masters menu if you've got the \"master's workshop\" module ready.",
        "You can enable breaking point checks and weapon and armor damage in the options.",
        "Modifiers by creature types are automatically applied. You can add on your weapons \"blessed\" and \"magical\" as domain to overcome their resistances.",
        "The \"Aventurian Armory 2\" enables the usage of the hitzone armor rule.",
        "You can sort actors in the master's menu with drag and drop.",
        "You can add actors and enemies to the master's menu with drag and drop.",
        "You can enable token name obfuscation on drop to the canvas in the settings.",
        "The link button next to the character name on the character sheet can be used to drag the character to the hotbar.",

        "The core modul can configure vision for tokens automatically.",
        "The library, the journal browser, the master's menu and the attack menu can be opened and closed via a keybinding.",
        "The system contains token borders for your own tokens.",
        "The module tokenizer is automatically configured, so you can quickly use TDE token borders on your own.",

        "The player menu can aid with summoning.",
        "The core module contains useful functions to adjust light settings.",
        "You can enable the modifier for foreign spells via the settings.",
        "Dice system of the \"Rollsmith\" can be added to the TDE dice.",

        "You get help in the Ulisses and Foundry Discord",

        "Add a demon mark to your character to track the circle of damnation.",
        "You can create weapons, which do extra damage versus certain creature types.",
        "You can create magical armor",
        "Add a patron to your character, if you want to play a geode.",
        "Items and abilities can contain an on-use effect",
        "The game master can add diseases to your character sheet.",
        "Active Effects can be limited to a spell property",
        "The module \"Automated Animations\" can add animations to your attacks and spells.",
        "Spells and magical signs can be paid via a rightclick on the chatcard.",
        "Activate the Dere Positioning System, so merchants can only be contacted from close distance.",
        "Activate the Dere Positioning System, so range modifiers will be set automatically in combat",
        "The core rule modules contains functions to automatically set sight."
    ]
}